[
  {
    "pauri_number": 1,
    "pauri_punjabi": "ੴ ਸਤਿ ਨਾਮੁ ਕਰਤਾ ਪੁਰਖੁ ਨਿਰਭਉ ਨਿਰਵੈਰੁ\nਅਕਾਲ ਮੂਰਤਿ ਅਜੂਨੀ ਸੈਭੰ ਗੁਰ ਪ੍ਰਸਾਦਿ ॥",
    "transliteration": "Ik Oankaar Sat Naam Karta Purakh Nirbhau Nirvair\nAkaal Moorat Ajooni Saibhang Gur Prasaad.",
    "translation": "There is One Universal Creator. His Name is Truth. He is the Creator, without fear, without hate,\nTimeless is His form, beyond birth and death, self-existent, known by the Guru’s Grace.",
    "explanation": "This is the Mool Mantar, the fundamental creed of Sikhism, encapsulating the core attributes of the Divine. 'Ik Oankaar' signifies the Oneness of God. 'Sat Naam' means His Name is Truth. 'Karta Purakh' identifies Him as the Creator Being. 'Nirbhau Nirvair' describes Him as without fear and without enmity. 'Akaal Moorat' refers to His timeless form, beyond the cycles of time. 'Ajooni Saibhang' means unborn and self-existent. 'Gur Prasaad' indicates that He is realized through the Guru's Grace. This mantra is the essence of Sikh theology, emphasizing the singular, eternal, and benevolent nature of God."
  },
  {
    "pauri_number": 2,
    "pauri_punjabi": "ਜਪੁ ॥\nਆਦਿ ਸਚੁ ਜੁਗਾਦਿ ਸਚੁ ॥\nਹੈ ਭੀ ਸਚੁ ਨਾਨਕ ਹੋਸੀ ਭੀ ਸਚੁ ॥੧॥",
    "transliteration": "Jap.\nAad Sach Jugaad Sach.\nHai Bhee Sach Naanak Hosee Bhee Sach. ||1||",
    "translation": "Chant and meditate:\nTrue in the beginning, True throughout the ages,\nTrue even now, O Nanak, He will be True in the future. ||1||",
    "explanation": "This is the opening verse of Japji, following the Mool Mantar. It declares the eternal and unchanging nature of Truth (God). It states that God was true from the very beginning, true throughout all ages, is true in the present, and will remain true in the future. This emphasizes the timelessness and absolute reality of the Divine, setting the foundation for the entire composition."
  },
  {
    "pauri_number": 3,
    "pauri_punjabi": "ਸੋਚੈ ਸੋਚਿ ਨ ਹੋਵਈ ਜੇ ਸੋਚੀ ਲਖ ਵਾਰ ॥\nਚੁਪੈ ਚੁਪ ਨ ਹੋਵਈ ਜੇ ਲਾਇ ਰਹਾ ਲਿਵ ਤਾਰ ॥\nਭੁਖਿਆ ਭੁਖ ਨ ਉਤਰੀ ਜੇ ਬੰਨਾ ਪੁਰੀਆ ਭਾਰ ॥\nਸਹਸ ਸਿਆਣਪਾ ਲਖ ਹੋਹਿ ਤ ਇਕ ਨ ਚਲੈ ਨਾਲਿ ॥\nਕਿਵ ਸਚਿਆਰਾ ਹੋਈਐ ਕਿਵ ਕੂੜੈ ਤੁਟੈ ਪਾਲਿ ॥\nਹੁਕਮਿ ਰਜਾਈ ਚਲਣਾ ਨਾਨਕ ਲਿਖਿਆ ਨਾਲਿ ॥੧॥",
    "transliteration": "Sochai Soch na hovai je sochi lakh vaar.\nChupai chup na hovai je laae rahaa liv taar.\nBhukhi-aa bhukh na utree je bannaa puree-aa bhaar.\nSahas si-aanpaa lakh hohi ta ik na chalai naal.\nKiv sachi-aaraa ho-ee-ai kiv koorhai tutai paal.\nHukam rajaa-ee chalnaa Naanak likhi-aa naal. ||1||",
    "translation": "By thinking, He cannot be reduced to thought, even by thinking hundreds of thousands of times.\nBy remaining silent, inner silence is not obtained, even by remaining lovingly absorbed deep within.\nThe hunger of the hungry is not appeased, even by piling up loads of worldly goods.\nHundreds of thousands of clever tricks, but not even one of them will go along with you in the end.\nSo, how can you become truthful? And how can the veil of illusion be torn away?\nO Nanak, it is written that you shall obey the Hukam of His Command, and walk in the Way of His Will. ||1||",
    "explanation": "This verse teaches that true understanding of God and inner purity cannot be achieved through external rituals or intellectual pursuits alone. It rejects the efficacy of mere thought, forced silence, material accumulation, or worldly cleverness in realizing the Divine. It poses a fundamental question: how can one become truthful and break the wall of falsehood? The answer is profound: by accepting and living according to God's 'Hukam' (Divine Will or Command). This sets the central theme of Japji Sahib, emphasizing surrender to the Divine Order."
  },
  {
    "pauri_number": 4,
    "pauri_punjabi": "ਹੁਕਮੀ ਹੋਵਨਿ ਆਕਾਰ ਹੁਕਮੁ ਨ ਕਹਿਆ ਜਾਈ ॥\nਹੁਕਮੀ ਹੋਵਨਿ ਜੀਅ ਹੁਕਮਿ ਮਿਲੈ ਵਡਿਆਈ ॥\nਹੁਕਮੀ ਉਤਮੁ ਨੀਚੁ ਹੁਕਮਿ ਲਿਖਿ ਦੁਖ ਸੁਖ ਪਾਈਅਹਿ ॥\nਇਕਨਾ ਹੁਕਮੀ ਬਖਸੀਸ ਇਕਿ ਹੁਕਮੀ ਸਦਾ ਭਵਾਈਅਹਿ ॥\nਹੁਕਮੈ ਅੰਦਰਿ ਸਭੁ ਕੋ ਬਾਹਰਿ ਹੁਕਮ ਨ ਕੋਇ ॥\nਨਾਨਕ ਹੁਕਮੈ ਜੇ ਬੁਝੈ ਤ ਹਉਮੈ ਕਹੈ ਨ ਕੋਇ ॥੨॥",
    "transliteration": "Hukmee hovan aakaar hukam na kahi-aa jaa-ee.\nHukmee hovan jee-a hukam milai vadi-aa-ee.\nHukmee utam neech hukam likh dukh sukh paa-ee-ah.\nIknaa hukmee bakhsees ik hukmee sadaa bhavaa-ee-ah.\nHukmai andar sabh ko baahar hukam na ko-e.\nNaanak hukmai je bujhai ta ha-umai kahai na ko-e. ||2||",
    "translation": "By His Command, bodies are created; His Command cannot be described.\nBy His Command, souls come into being; by His Command, greatness is obtained.\nBy His Command, some are high and some are low; by His Command, pain and pleasure are inscribed.\nBy His Command, some are blessed with forgiveness; by His Command, others are made to wander forever.\nEveryone is subject to His Command; no one is outside of His Command.\nO Nanak, one who understands His Command, does not speak in ego. ||2||",
    "explanation": "This pauri elaborates on the concept of 'Hukam' (Divine Will). It states that everything in creation, from the formation of bodies to the existence of souls, and the distribution of joy and sorrow, is by God's Command. It emphasizes that 'Hukam' is all-encompassing – no one is outside its purview. The understanding and acceptance of 'Hukam' lead to the dissolution of ego ('haumai'), as one realizes that all is by Divine Will, leaving no room for personal pride or claims of self-agency. This brings humility and a deeper connection with the Creator."
  },
  {
    "pauri_number": 5,
    "pauri_punjabi": "ਗਾਵੈ ਕੋ ਤਾਣੁ ਹੋਵੈ ਕਿਸੈ ਤਾਣੁ ॥\nਗਾਵੈ ਕੋ ਦਾਤਿ ਜਾਣੈ ਨੀਸਾਣੁ ॥\nਗਾਵੈ ਕੋ ਗੁਣ ਵਡਿਆਈਆ ਚਾਰ ॥\nਗਾਵੈ ਕੋ ਵਿਦਿਆ ਵਿਖਮ ਵੀਚਾਰੁ ॥\nਗਾਵੈ ਕੋ ਸਾਜਿ ਕਰੇ ਤਨੁ ਖੇਹ ॥\nਗਾਵੈ ਕੋ ਜੀਅ ਲੈ ਫਿਰਿ ਦੇਹ ॥\nਗਾਵੈ ਕੋ ਜਾਪੈ ਦਿਸੈ ਦੂਰਿ ॥\nਗਾਵੈ ਕੋ ਵੇਖੈ ਹਾਦਰਾ ਹਦੂਰਿ ॥\nਕਥਨਾ ਕਥੀ ਨ ਆਵੈ ਤੋਟਿ ॥\nਕਥਿ ਕਥਿ ਕਥੀ ਕੋਟੀ ਕੋਟਿ ਕੋਟਿ ॥\nਦੇਦਾ ਦੇ ਲੈਦੇ ਥਕਿ ਪਾਹਿ ॥\nਜੁਗਾ ਜੁਗੰਤਰਿ ਖਾਹੀ ਖਾਹਿ ॥\nਹੁਕਮੀ ਹੁਕਮੁ ਚਲਾਏ ਰਾਹੁ ॥\nਨਾਨਕ ਵਿਗਸੈ ਵੇਪਰਵਾਹੁ ॥੩॥",
    "transliteration": "Gaavai ko taan hovai kisai taan.\nGaavai ko daat jaanai neesaan.\nGaavai ko gun vadi-aa-ee-aa chaar.\nGaavai ko vidi-aa vikham veechaar.\nGaavai ko saaj kare tan kheh.\nGaavai ko jee-a lai fir deh.\nGaavai ko jaapai disai door.\nGaavai ko vekhai haadraa hadoor.\nKathnaa kathee na aavai tot.\nKath kath kathee kotee kot kot.\nDeydaa de laide thak paahi.\nJugaa jugantar khaahee khaahi.\nHukmee hukam chalaae raahu.\nNaanak vigsai veparvaahu. ||3||",
    "translation": "Some sing of His power, if they have the power to do so.\nSome sing of His gifts, recognizing His signs.\nSome sing of His glorious, beautiful attributes.\nSome sing of His wisdom, and of difficult spiritual reflections.\nSome sing that He creates the body and then reduces it to dust.\nSome sing that He takes life away, and then gives it back again.\nSome sing that He seems so far away.\nSome sing that He watches, ever-present, close at hand.\nThe tellers tell, but their telling does not come to an end.\nThe speakers speak, millions upon millions of them.\nThe Great Giver keeps on giving, while the receivers grow weary of receiving.\nThroughout the ages, consumers consume.\nBy His Command, the Commander walks on His Way.\nO Nanak, He blossoms forth, free of all care. ||3||",
    "explanation": "This pauri highlights the diverse ways in which people try to comprehend and describe God, yet ultimately fail to fully grasp His infinite nature. It lists various aspects people focus on – His power, gifts, attributes, wisdom, ability to create and destroy, and His perceived distance or closeness. Despite countless attempts to describe Him, His virtues and generosity are inexhaustible. The core message reiterates that God acts by His own 'Hukam,' untroubled and boundless, emphasizing His independent and sovereign nature. Human efforts to define Him are always limited."
  },
  {
    "pauri_number": 6,
    "pauri_punjabi": "ਸਾਚਾ ਸਾਹਿਬੁ ਸਾਚੁ ਨਾਇ ਭਾਖਿਆ ਭਾਉ ਅਪਾਰੁ ॥\nਆਖਹਿ ਮੰਗਹਿ ਦੇਹਿ ਦੇਹਿ ਦਾਤਿ ਕਰੇ ਦਾਤਾਰੁ ॥\nਫੇਰਿ ਕਿ ਅਗੈ ਰਖੀਐ ਜਿਤੁ ਦਿਸੈ ਦਰਬਾਰੁ ॥\nਮੁਹੌ ਕਿ ਬੋਲਣੁ ਬੋਲੀਐ ਜਿਤੁ ਸੁਣਿ ਧਰੇ ਪਿਆਰੁ ॥\nਅੰਮ੍ਰਿਤ ਵੇਲਾ ਸਚੁ ਨਾਉ ਵਡਿਆਈ ਵੀਚਾਰੁ ॥\nਕਰਮੀ ਆਵੈ ਕਪੜਾ ਨਦਰੀ ਮੋਖੁ ਦੁਆਰੁ ॥\nਨਾਨਕ ਏਵੈ ਜਾਣੀਐ ਸਭੁ ਆਪੇ ਸਚਿਆਰੁ ॥੪॥",
    "transliteration": "Saachaa Saahib Saach Naae Bhaakhi-aa Bha-o Apaar.\nAakhahi Mangahi Dehi Dehi Daat Kare Daataar.\nPher ki agai rakhi-ai jit disai darbaar.\nMuho ki bolan bolee-ai jit sun dhare pi-aar.\nAmrit Vela Sach Naa-o Vadi-aa-ee Veechaar.\nKarmee aavai kapraa nadree mokh du-aar.\nNaanak evai jaanee-ai sabh aape sachi-aar. ||4||",
    "translation": "The True Lord, True is His Name; His language is boundless love.\nPeople pray and beg, 'Give, give,' and the Great Giver grants His gifts.\nSo what offering can we place before Him, by which we might see His Darbar, His Court?\nWhat words can we speak with our mouths, which would inspire Him to lovingly listen?\nIn the Amrit Vaylā, the ambrosial hours of the morning, chant the True Name, and contemplate His Glorious Greatness.\nBy the karma of past actions, the robe of this human body is obtained; by His Grace, the Door of Liberation is found.\nO Nanak, know that the True One Himself is All. ||4||",
    "explanation": "This pauri begins by affirming God as the True Master whose Name is Truth and whose essence is boundless love. It acknowledges humanity's constant asking for gifts from this Great Giver. It then poses a crucial question: how can we truly connect with Him and receive His love? The answer is to meditate on the True Name ('Sach Naao') and contemplate His greatness during 'Amrit Vela' (the ambrosial hours before dawn). It also introduces the concept that the human birth ('kapraa') is a result of past karma, but liberation ('mokh du-aar') is attained only through God's Grace ('Nadree'). The verse concludes by emphasizing that God Himself is the ultimate Truth and Reality."
  },
  {
    "pauri_number": 7,
    "pauri_punjabi": "ਥਾਪਿਆ ਨ ਜਾਇ ਕੀਤਾ ਨ ਹੋਇ ॥\nਆਪੇ ਆਪਿ ਨਿਰੰਜਨੁ ਸੋਇ ॥\nਜਿਨਿ ਸੇਵਿਆ ਤਿਨਿ ਪਾਇਆ ਮਾਨੁ ॥\nਨਾਨਕ ਗਾਵੀਐ ਗੁਣੀ ਨਿਧਾਨੁ ॥\nਗਾਵੀਐ ਸੁਣੀਐ ਮਨਿ ਰਖੀਐ ਭਾਉ ॥\nਦੁਖੁ ਪਰਹਰਿ ਸੁਖੁ ਘਰਿ ਲੈ ਜਾਇ ॥\nਗੁਰਮੁਖਿ ਨਾਦੰ ਗੁਰਮੁਖਿ ਵੇਦੰ ਗੁਰਮੁਖਿ ਰਹਿਆ ਸਮਾਈ ॥\nਗੁਰ ਈਸਰੁ ਗੁਰੁ ਗੋਰਖੁ ਬਰਮਾ ਗੁਰੁ ਪਾਰਬਤੀ ਮਾਈ ॥\nਜੇ ਹਉ ਜਾਣਾ ਆਖਾ ਨਾਹੀ ਕਹਣਾ ਕਥਨੁ ਨ ਜਾਈ ॥\nਗੁਰਾ ਇਕ ਦੇਹਿ ਬੁਝਾਈ ॥\nਸਭਨਾ ਜੀਆ ਕਾ ਇਕੁ ਦਾਤਾ ਸੋ ਮੈ ਵਿਸਰਿ ਨ ਜਾਈ ॥੫॥",
    "transliteration": "Thaapi-aa na jaae keetaa na ho-e.\nAape Aap niranjan so-e.\nJin sevi-aa tin paa-i-aa maan.\nNaanak gaavee-ai Gunee Nidhaan.\nGaavee-ai sunee-ai man rakhee-ai bha-o.\nDukh parhar sukh ghar lai jaae.\nGurmukh naadang Gurmukh vedang Gurmukh rahi-aa samaa-ee.\nGur Eesar Gur Gorakh Barmaa Gur Paarvatee Maa-ee.\nJe ha-o jaanaa aakhaa naahee kahnaa kathan na jaa-ee.\nGuraa ik dehi bujhaa-ee.\nSabhnaa jee-aa kaa ik daataa so mai visar na jaa-ee. ||5||",
    "translation": "He cannot be established, nor can He be created.\nHe Himself is the Immaculate One.\nWhoever serves Him, obtains honor.\nO Nanak, sing of the Lord, the Treasure of Virtue.\nSing, and listen, and keep His love in your mind.\nSorrow shall be dispelled, and peace shall come to your home.\nThe Gurmukh (Guru-oriented) understands the spiritual sound current; the Gurmukh understands the Vedas; the Gurmukh understands that God is pervading everywhere.\nThe Guru is Shiva, the Guru is Gorakh, Brahma, and the Divine Mother Paarvati.\nEven if I knew, I could not describe it; it cannot be described in words.\nThe Guru has blessed me with this one understanding:\nThere is only One Giver to all beings; may I never forget Him. ||5||",
    "explanation": "This pauri states that God is not created or established by anyone; He is self-existent and pure. It emphasizes that those who serve Him gain honor. The core teaching is to sing praises of God, listen to His Word, and keep His love in the heart, which leads to the removal of sorrow and the attainment of peace. It then extols the role of the Guru, defining the 'Gurmukh' (one who follows the Guru) as capable of understanding spiritual truths and the pervasive nature of God. The Guru is equated with various deities (Shiva, Gorakh, Brahma, Paarvati) not to imply polytheism, but to highlight the Guru's supreme spiritual authority and guidance, encompassing all aspects of divine wisdom. The pauri concludes with Guru Nanak's profound realization: even if one knew, God's greatness cannot be fully described. The ultimate understanding given by the Guru is that there is only One Giver for all beings, and this truth should never be forgotten."
  },
  {
    "pauri_number": 8,
    "pauri_punjabi": "ਤੀਰਥਿ ਨਾਵਾ ਜੇ ਤਿਸੁ ਭਾਵਾ ਵਿਣੁ ਭਾਣੇ ਕਿ ਨਾਇ ਕਰੀ ॥\nਜੇਤੀ ਸਿਰਠਿ ਉਪਾਈ ਵੇਖਾ ਵਿਣੁ ਕਰਮਾ ਕਿ ਮਿਲੈ ਲਈ ॥\nਮਤਿ ਵਿਚਿ ਰਤਨ ਜਵਾਹਰ ਮਾਣਿਕ ਜੇ ਇਕ ਗੁਰ ਕੀ ਸਿਖ ਸੁਣੀ ॥\nਗੁਰਾ ਇਕ ਦੇਹਿ ਬੁਝਾਈ ॥\nਸਭਨਾ ਜੀਆ ਕਾ ਇਕੁ ਦਾਤਾ ਸੋ ਮੈ ਵਿਸਰਿ ਨ ਜਾਈ ॥੬॥",
    "transliteration": "Teerath naavaa je tis bhaavaa vin bhaane ki naae karee.\nJetee sirath upaa-ee vekhaa vin karmaa ki milai la-ee.\nMat vich ratan javaahar maanik je ik Gur kee sikh sunee.\nGuraa ik dehi bujhaa-ee.\nSabhnaa jee-aa kaa ik daataa so mai visar na jaa-ee. ||6||",
    "translation": "I would bathe at sacred shrines, if it pleased Him; otherwise, what good is ritual bathing?\nAs many beings as I behold created, I see that without good deeds, what can one receive?\nWithin the intellect are jewels, gems, and rubies, if one listens to the Guru’s teaching.\nThe Guru has blessed me with this one understanding:\nThere is only One Giver to all beings; may I never forget Him. ||6||",
    "explanation": "This pauri continues the theme of external rituals being secondary to divine grace and understanding. It questions the efficacy of pilgrimage (bathing at sacred shrines) if it does not align with God's will. It also asserts that worldly attainments are a result of one's actions ('karma'). However, the true treasures – spiritual jewels, gems, and rubies (wisdom, enlightenment) – are found within the intellect when one sincerely listens to and follows the Guru's teachings ('Gur kee sikh'). The concluding lines, repeated from the previous pauri, reinforce the central revelation received from the Guru: the singularity of the Divine Giver and the importance of never forgetting this truth."
  },
  {
    "pauri_number": 9,
    "pauri_punjabi": "ਜੇ ਜੁਗ ਚਾਰੇ ਆਰਜਾ ਹੋਰ ਦਸੂਣੀ ਹੋਇ ॥\nਨਵਾ ਖੰਡਾ ਵਿਚਿ ਜਾਣੀਐ ਨਾਲਿ ਚਲੈ ਸਭੁ ਕੋਇ ॥\nਚੰਗਾ ਨਾਉ ਰਖਾਇ ਕੈ ਜਸੁ ਕੀਰਤਿ ਜਗਿ ਲੇਇ ॥\nਜੇ ਤਿਸੁ ਨਦਰਿ ਨ ਆਵਈ ਤ ਵਾਤ ਨ ਪੁਛੈ ਕੋਇ ॥\nਕੀਟਾ ਅੰਦਰਿ ਕੀਟੁ ਕਰਿ ਦੋਸੀ ਦੋਸੁ ਧਰੇ ॥\nਨਾਨਕ ਨਿਰਗੁਣਿ ਗੁਣੁ ਕਰੇ ਗੁਣਵੰਤਿਆ ਗੁਣੁ ਦੇ ॥\nਤੇਹਾ ਕੋਇ ਨ ਸੁਝਈ ਜਿ ਤਿਸੁ ਗੁਣੁ ਕੋਇ ਕਰੇ ॥੭॥",
    "transliteration": "Je jug chaare aarjā hor dasoonee ho-e.\nNavaa Khandaa vich jaanee-ai naal chalai sabh ko-e.\nChangaa Naao rakhaa-e kai jas keerat jag le-e.\nJe tis nadar na aava-ee ta vaat na puchhai ko-e.\nKeetaa andar keet kar dose dos dhare.\nNaanak nirgun gun kare gunvantee-aa gun de.\nTehaa ko-e na sujh-ee je tis gun ko-e kare. ||7||",
    "translation": "Even if one were to live through the four ages, or even ten times longer,\nAnd be known throughout the nine continents, with everyone following in their wake;\nAnd earn a good name, and gain fame and praise throughout the world;\nIf He does not cast His Glance of Grace, then no one would care to ask about them.\nHe makes worms out of worms, and makes the sinner sinful.\nO Nanak, He blesses the worthless with worth, and gives virtue to the virtuous.\nNo one can be found who can bestow virtue upon Him. ||7||",
    "explanation": "This pauri emphasizes that worldly achievements, longevity, fame, and popularity are ultimately meaningless without God's Grace ('Nadar'). Even if one lives for eons, is known worldwide, and earns immense respect, if God does not cast His gracious glance, all such accomplishments are futile. It highlights God's absolute sovereignty and His ability to transform even the most worthless into virtuous beings, and to further empower the virtuous. The verse concludes by stating that no one can bestow any virtue upon God, affirming His absolute perfection and self-sufficiency. All goodness originates from Him."
  },
  {
    "pauri_number": 10,
    "pauri_punjabi": "ਸੁਣਿਐ ਸਿਧ ਪੀਰ ਸੁਰਿ ਨਾਥ ॥\nਸੁਣਿਐ ਧਰਤਿ ਧਵਲ ਆਕਾਸ ॥\nਸੁਣਿਐ ਦੀਪ ਲੋਅ ਪਾਤਾਲ ॥\nਸੁਣਿਐ ਪੋਹਿ ਨ ਸਕੈ ਕਾਲੁ ॥\nਨਾਨਕ ਭਗਤਾ ਸਦਾ ਵਿਗਾਸੁ ॥\nਸੁਣਿਐ ਦੂਖ ਪਾਪ ਕਾ ਨਾਸੁ ॥੮॥",
    "transliteration": "Suni-ai sidh peer suri naath.\nSuni-ai dharat dhaval aakaas.\nSuni-ai deep lo-a paataal.\nSuni-ai pohi na sakai kaal.\nNaanak bhagtaa sadaa vigaas.\nSuni-ai dookh paap kaa naas. ||8||",
    "translation": "By listening, one becomes a Siddha, a Pir, a spiritual hero, a master.\nBy listening, one comprehends the earth, its supporting forces, and the ethers.\nBy listening, one comprehends the continents, the worlds, and the nether regions.\nBy listening, the fear of death cannot touch you.\nO Nanak, the devotees are forever in bliss.\nBy listening, suffering and sin are erased. ||8||",
    "explanation": "This pauri begins a series of verses (Pauris 8-11) praising the power and benefits of 'Sunna' (listening to or heeding the Divine Word/Name). It states that by listening, one can attain the spiritual status of Siddhas (perfected ones), Pirs (Muslim saints), and spiritual masters. Listening brings understanding of the vast universe – earth, sky, continents, and nether regions. Crucially, it liberates one from the fear of death. For devotees, listening brings perpetual bliss, and it leads to the destruction of suffering and sin. This emphasizes the transformative power of internalizing the Divine Message."
  },
  {
    "pauri_number": 11,
    "pauri_punjabi": "ਸੁਣਿਐ ਈਸਰੁ ਬਰਮਾ ਇੰਦੁ ॥\nਸੁਣਿਐ ਮੁਖਿ ਸਾਲਾਹਣ ਮੰਦੁ ॥\nਸੁਣਿਐ ਜੋਗ ਜੁਗਤਿ ਤਨਿ ਭੇਦ ॥\nਸੁਣਿਐ ਸਾਸਤ ਸਿੰਮ੍ਰਿਤਿ ਵੇਦ ॥\nਨਾਨਕ ਭਗਤਾ ਸਦਾ ਵਿਗਾਸੁ ॥\nਸੁਣਿਐ ਦੂਖ ਪਾਪ ਕਾ ਨਾਸੁ ॥੯॥",
    "transliteration": "Suni-ai Eesar Barmaa Ind.\nSuni-ai mukh saalaahan mand.\nSuni-ai jog jugat tan bhed.\nSuni-ai saasat simrit ved.\nNaanak bhagtaa sadaa vigaas.\nSuni-ai dookh paap kaa naas. ||9||",
    "translation": "By listening, one understands Shiva, Brahma, and Indra.\nBy listening, even the mouth of the slanderer praises God.\nBy listening, one understands the ways of Yoga and the secrets of the body.\nBy listening, one understands the Shastras, the Simritees, and the Vedas.\nO Nanak, the devotees are forever in bliss.\nBy listening, suffering and sin are erased. ||9||",
    "explanation": "Continuing the theme of 'Sunna', this pauri further details the benefits of listening to the Divine Word. It asserts that by listening, one can comprehend the nature of deities like Shiva, Brahma, and Indra (representing different aspects of creation, preservation, and destruction in Hindu mythology). It has the power to transform even a slanderer into a praiser of God. Listening also reveals the secrets of Yoga and the mysteries of the human body, as well as the wisdom contained in various religious scriptures like the Shastras, Smritis, and Vedas. The repeated concluding lines reiterate the profound outcome: devotees find eternal bliss, and suffering and sin are eradicated through this profound act of listening and internalizing."
  },
  
  {
    "pauri_number": 12,
    "pauri_punjabi": "ਸੁਣਿਐ ਸਤੁ ਸੰਤੋਖੁ ਗਿਆਨੁ ॥\nਸੁਣਿਐ ਅਠਸਠਿ ਕਾ ਇਸਨਾਨੁ ॥\nਸੁਣਿਐ ਪੜਿ ਪੜਿ ਪਾਵਹਿ ਮਾਨੁ ॥\nਸੁਣਿਐ ਲਾਗੈ ਸਹਜਿ ਧਿਆਨੁ ॥\nਨਾਨਕ ਭਗਤਾ ਸਦਾ ਵਿਗਾਸੁ ॥\nਸੁਣਿਐ ਦੂਖ ਪਾਪ ਕਾ ਨਾਸੁ ॥੧੦॥",
    "transliteration": "Suni-ai sat santokh gi-aan.\nSuni-ai athsath kaa isnaan.\nSuni-ai parh parh paavahi maan.\nSuni-ai laagai sahaj dhi-aan.\nNaanak bhagtaa sadaa vigaas.\nSuni-ai dookh paap kaa naas. ||10||",
    "translation": "By listening, one gains truth, contentment, and spiritual wisdom.\nBy listening, one obtains the merit of bathing at the sixty-eight sacred shrines.\nBy listening, scholars achieve honor through their studies.\nBy listening, one spontaneously enters into deep meditation.\nO Nanak, the devotees are forever in bliss.\nBy listening, suffering and sin are erased. ||10||",
    "explanation": "This pauri continues the glorification of 'Sunna' (listening to the Divine Word). It states that through listening, one cultivates virtues like **truthfulness (sat)**, **contentment (santokh)**, and **spiritual knowledge (giaan)**. It metaphorically suggests that the spiritual purification achieved by listening is equivalent to the merit of bathing at all sixty-eight sacred pilgrimage sites, emphasizing the internal purity over external rituals. Furthermore, listening brings honor to scholars and naturally leads to **spontaneous meditation (sahaj dhiaan)**. The concluding lines, a refrain in these pauris, reaffirm that listening brings perpetual bliss to devotees and eradicates sorrow and sin."
  },
  {
    "pauri_number": 13,
    "pauri_punjabi": "ਸੁਣਿਐ ਸਰਾ ਗੁਣਾ ਕੇ ਗਾਹ ॥\nਸੁਣਿਐ ਸੇਖ ਪੀਰ ਪਾਤਿਸਾਹ ॥\nਸੁਣਿਐ ਅੰਧੇ ਪਾਵਹਿ ਰਾਹੁ ॥\nਸੁਣਿਐ ਹਾਥ ਹੋਵੈ ਅਸਗਾਹੁ ॥\nਨਾਨਕ ਭਗਤਾ ਸਦਾ ਵਿਗਾਸੁ ॥\nਸੁਣਿਐ ਦੂਖ ਪਾਪ ਕਾ ਨਾਸੁ ॥੧੧॥",
    "transliteration": "Suni-ai saraa gunaa ke gaah.\nSuni-ai sekh peer paatisaah.\nSuni-ai andhe paavahi raahu.\nSuni-ai haath hovai asgaahu.\nNaanak bhagtaa sadaa vigaas.\nSuni-ai dookh paap kaa naas. ||11||",
    "translation": "By listening, one plunges into the ocean of virtues.\nBy listening, one becomes a Sheikh, a Pir, or a King.\nBy listening, the blind find the path.\nBy listening, the unfathomable becomes fathomable in one's hands.\nO Nanak, the devotees are forever in bliss.\nBy listening, suffering and sin are erased. ||11||",
    "explanation": "This is the final pauri in the series on 'Sunna'. It portrays listening as a means to dive into the **ocean of virtues**. It suggests that through sincere listening, one can attain high spiritual and worldly status, becoming like a **Sheikh, Pir, or even a King** (implying spiritual sovereignty). Crucially, it highlights the power of listening to guide the 'blind' (spiritually ignorant) onto the right path and to make the seemingly **unfathomable (God's mysteries)** accessible and understandable. The repeated concluding lines stress the continuous bliss for devotees and the eradication of sorrow and sin through this profound act of listening."
  },
  {
    "pauri_number": 14,
    "pauri_punjabi": "ਮੰਨੈ ਕੀ ਗਤਿ ਕਹੀ ਨ ਜਾਇ ॥\nਜੇ ਕੋ ਕਹੈ ਤ ਪਿਛੈ ਪਛੁਤਾਇ ॥\nਕਾਗਦਿ ਕਲਮ ਨ ਲਿਖਣਹਾਰੁ ॥\nਮੰਨੈ ਕਾ ਬਹਿ ਕਰਹਿ ਵੀਚਾਰੁ ॥\nਐਸਾ ਨਾਮੁ ਨਿਰੰਜਨੁ ਹੋਇ ॥\nਜੇ ਕੋ ਮੰਨਿ ਜਾਣੈ ਮਨਿ ਕੋਇ ॥੧੨॥",
    "transliteration": "Mannai kee gat kahee na jaae.\nJe ko kahai ta pichhai pachhutaa-e.\nKaagad kalam na likhanhaar.\nMannai kaa bahi karahi veechaar.\nAisaa naam niranjan ho-e.\nJe ko man jaanai man ko-e. ||12||",
    "translation": "The state of the faithful cannot be described.\nEven if someone tries to describe it, they will later regret it.\nNo paper, no pen, no scribe\nCan describe the state of the faithful.\nSuch is the Immaculate Name.\nIf one believes and knows it in their mind. ||12||",
    "explanation": "This pauri introduces the concept of 'Mannai' (faith, acceptance, or believing in the Divine Word). It emphasizes that the **spiritual state of a faithful person is ineffable**; it cannot be truly described or fully grasped through words. Attempts to articulate it are futile and will lead to regret. No human means—neither paper, pen, nor scribe—can capture its essence. The Name of the Immaculate Lord is of such profound nature that its power is realized only when one truly **accepts and embodies it within the mind**. This shift from 'listening' to 'believing/accepting' signifies a deeper level of spiritual engagement."
  },
  {
    "pauri_number": 15,
    "pauri_punjabi": "ਮੰਨੈ ਸੁਰਤਿ ਹੋਵੈ ਮਨਿ ਬੁਧਿ ॥\nਮੰਨੈ ਸਗਲ ਭਵਣ ਕੀ ਸੁਧਿ ॥\nਮੰਨੈ ਮੁਹਿ ਚੋਟਾ ਨਾ ਖਾਇ ॥\nਮੰਨੈ ਜਮ ਕੈ ਸਾਥਿ ਨ ਜਾਇ ॥\nਐਸਾ ਨਾਮੁ ਨਿਰੰਜਨੁ ਹੋਇ ॥\nਜੇ ਕੋ ਮੰਨਿ ਜਾਣੈ ਮਨਿ ਕੋਇ ॥੧੩॥",
    "transliteration": "Mannai surat hovai man budh.\nMannai sagal bhavan kee sudh.\nMannai muh chotaa naa khaa-e.\nMannai jam kai saath na jaae.\nAisaa Naam Niranjan ho-e.\nJe ko man jaanai man ko-e. ||13||",
    "translation": "By believing, understanding and intelligence are attained in the mind.\nBy believing, one gains knowledge of all worlds.\nBy believing, one does not suffer blows to the face (disgrace).\nBy believing, one does not go along with the Messenger of Death.\nSuch is the Immaculate Name.\nIf one believes and knows it in their mind. ||13||",
    "explanation": "This pauri continues to delineate the benefits of 'Mannai'. It states that through unwavering faith, one gains **spiritual awareness (surat)**, **mental clarity**, and **intellectual understanding (budh)**. This leads to a comprehensive awareness of all realms and existence. A faithful person is protected from **disgrace (muh chotaa)** in this world and, more importantly, from the **clutches of death (Jam)** and the cycle of rebirth. The concluding lines, repeated from the previous pauri, emphasize that this profound power resides in the Immaculate Name, accessible to those who truly believe and internalize it."
  },
  {
    "pauri_number": 16,
    "pauri_punjabi": "ਮੰਨੈ ਮਾਰਗਿ ਠਾਕ ਨ ਪਾਇ ॥\nਮੰਨੈ ਪਤਿ ਸਿਉ ਪਰਗਟੁ ਜਾਇ ॥\nਮੰਨੈ ਮਗੁ ਨ ਚਲੈ ਪੰਥੁ ॥\nਮੰਨੈ ਧਰਮ ਸੇਤੀ ਸਨਬੰਧੁ ॥\nਐਸਾ ਨਾਮੁ ਨਿਰੰਜਨੁ ਹੋਇ ॥\nਜੇ ਕੋ ਮੰਨਿ ਜਾਣੈ ਮਨਿ ਕੋਇ ॥੧੪॥",
    "transliteration": "Mannai maarag thaak na paae.\nMannai pat si-o pargat jaae.\nMannai mag na chalai panth.\nMannai dharam setee sanbandh.\nAisaa Naam Niranjan ho-e.\nJe ko man jaanai man ko-e. ||14||",
    "translation": "By believing, one's path is not obstructed.\nBy believing, one goes forth with honor and renown.\nBy believing, one follows no particular path or sect (but the true path).\nBy believing, one connects with righteousness and Dharma.\nSuch is the Immaculate Name.\nIf one believes and knows it in their mind. ||14||",
    "explanation": "This pauri highlights the practical and spiritual benefits of 'Mannai' on one's life path. It states that true faith removes obstacles from one's spiritual journey, allowing them to proceed with **honor and dignity**. It implies that those with 'Mannai' are not bound by rigid sectarian paths but rather find the universal 'true path'. Furthermore, believing connects one deeply with **righteousness (Dharam)** and moral conduct. The recurring refrain reiterates that the Immaculate Name holds this power, accessible only to those who truly believe and internalize it in their hearts."
  },
  {
    "pauri_number": 17,
    "pauri_punjabi": "ਮੰਨੈ ਪਾਵਹਿ ਮੋਖੁ ਦੁਆਰੁ ॥\nਮੰਨੈ ਪਰਵਾਰੈ ਸਾਧਾਰੁ ॥\nਮੰਨੈ ਤਰੈ ਤਾਰੇ ਗੁਰੁ ਸਿਖ ॥\nਮੰਨੈ ਨਾਨਕ ਭਵਹਿ ਨ ਭਿਖ ॥\nਐਸਾ ਨਾਮੁ ਨਿਰੰਜਨੁ ਹੋਇ ॥\nਜੇ ਕੋ ਮੰਨਿ ਜਾਣੈ ਮਨਿ ਕੋਇ ॥੧੫॥",
    "transliteration": "Mannai paavahi mokh du-aar.\nMannai parvaarai saadhaar.\nMannai tarai taare Gur sikh.\nMannai Naanak bhavahi na bhikh.\nAisaa Naam Niranjan ho-e.\nJe ko man jaanai man ko-e. ||15||",
    "translation": "By believing, one finds the Gate of Liberation.\nBy believing, one's family is also saved.\nBy believing, the Guru's disciple is saved, and saves others.\nO Nanak, by believing, one does not wander as a beggar.\nSuch is the Immaculate Name.\nIf one believes and knows it in their mind. ||15||",
    "explanation": "This pauri concludes the 'Mannai' series by outlining its ultimate spiritual rewards. It states that true faith leads to the **Door of Liberation (Mokh Du-aar)**, freeing one from the cycle of rebirth. The power of 'Mannai' extends beyond the individual, as it becomes a means of **support for one's family**, implying spiritual upliftment for them. A Guru's disciple who believes not only saves themselves but also **helps others cross the ocean of existence**. Finally, through faith, one escapes the need to 'beg' spiritually or materially, finding inner fulfillment. The recurring refrain underscores that this transformative power resides in the Immaculate Name for those who truly believe."
  },
  {
    "pauri_number": 18,
    "pauri_punjabi": "ਪੰਚ ਪਰਵਾਣ ਪੰਚ ਪਰਧਾਨੁ ॥\nਪੰਚੇ ਪਾਵਹਿ ਦਰਗਹਿ ਮਾਨੁ ॥\nਪੰਚੇ ਸੋਹਹਿ ਦਰਿ ਰਾਜਾਨੁ ॥\nਪੰਚਾ ਕਾ ਗੁਰੁ ਏਕੁ ਧਿਆਨੁ ॥\nਜੇ ਕੋ ਕਹੈ ਕਰੈ ਵੀਚਾਰੁ ॥\nਕਰਤੇ ਕੈ ਕਰਣੈ ਨਾਹੀ ਸੁਮਾਰੁ ॥\nਧੌਲੁ ਧਰਮੁ ਦਇਆ ਕਾ ਪੂਤੁ ॥\nਸੰਤੋਖੁ ਥਾਪਿ ਰਖਿਆ ਜਿਨਿ ਸੂਤਿ ॥\nਜੇ ਕੋ ਬੁਝੈ ਹੋਵੈ ਸਚਿਆਰੁ ॥\nਧਵਲੈ ਉਪਰਿ ਕੇਤਾ ਭਾਰੁ ॥\nਧਰਤੀ ਹੋਰੁ ਪਰੈ ਹੋਰੁ ਹੋਰੁ ॥\nਤਿਸੁ ਭਾਰੁ ਤਲੈ ਕਵਣੁ ਜੋਰੁ ॥\nਜੀਅ ਜਾਤਿ ਰੰਗਾ ਕੇ ਨਾਵ ॥\nਸਭਨਾ ਲਿਖਿਆ ਵੁੜੀ ਕਲਾਮ ॥\nਏਹੁ ਲੇਖਾ ਲਿਖਿ ਜਾਣੈ ਕੋਇ ॥\nਤਾ ਲੇਖਾ ਲਿਖਿਆ ਕੇਤਾ ਹੋਇ ॥\nਕੇਤਾ ਤਾਣੁ ਸੁਆਲਿਹੁ ਰੂਪੁ ॥\nਕੇਤੀ ਦਾਤਿ ਜਾਣੈ ਕਉਣੁ ਕੂਤੁ ॥\nਕੀਤਾ ਪਸਾਉ ਏਕੋ ਕਵਾਉ ॥\nਤਿਸ ਤੇ ਹੋਏ ਲਖ ਦਰੀਆਉ ॥\nਕੁਦਰਤਿ ਕਵਣ ਕਹਾ ਵੀਚਾਰੁ ॥\nਵਾਰਿਆ ਨ ਜਾਵਾ ਏਕ ਵਾਰ ॥\nਜੋ ਤੁਧੁ ਭਾਵੈ ਸਾਈ ਭਲੀ ਕਾਰ ॥\nਤੂ ਸਦਾ ਸਲਾਮਤਿ ਨਿਰੰਕਾਰ ॥੧੬॥",
    "transliteration": "Panch parvaan panch pardhaan.\nPanche paavahi dargah maan.\nPanche sohahi dar raajaan.\nPanchaa kaa Gur ek dhiaan.\nJe ko kahai karai veechaar.\nKarte kai karni naahee sumaar.\nDhaul dharam da-i-aa kaa poot.\nSantokh thaap rakhi-aa jin soot.\nJe ko bujhai hovai sachi-aar.\nDhavlai upar ketaa bhaar.\nDhartee hor parai hor hor.\nTisu bhaar talai kavan jor.\nJee-a jaat rangaa ke naav.\nSabhnaa likhi-aa vurhee kalaam.\nEh lekhaa likh jaanai ko-e.\nTaa lekhaa likhi-aa ketaa ho-e.\nKetaa taan su-aalih roop.\nKetee daat jaanai ka-un koot.\nKeetaa pasaao eko kavaao.\nTis te ho-e lakh daree-aao.\nKudrat kavan kahaa veechaar.\nVaari-aa na jaavaa ek vaar.\nJo tudh bhaavai saa-ee bhalee kaar.\nToo sadaa salaamat Nirankaar. ||16||",
    "translation": "The five accepted ones, the five distinguished ones.\nThe five attain honor in the Court of the Lord.\nThe five look beautiful at the King’s Gate.\nTheir Guru is their one-pointed meditation on God.\nWhoever tries to describe and reflect upon it—\nThe creative power of the Creator is beyond measure.\nRighteousness, the son of compassion, is the mythical bull.\nBy contentment, He established the universe in its place.\nIf one understands this, they become truthful.\nHow much weight is on that bull?\nThere are other earths, and still more beyond.\nWhat power supports the weight beneath them?\nThere are so many species of beings, of so many colors and names.\nAll are written by the flowing pen of destiny.\nIf anyone tries to write this account,\nThen how extensive would that account be?\nHow great is His power, and how beautiful His form?\nWho can estimate His gifts?\nHe created the expansion of the universe with a single Word.\nFrom that, hundreds of thousands of rivers (of life) began to flow.\nWhat power do I have to describe Your wondrous ways?\nI cannot even once be a sacrifice to You.\nWhatever pleases You, that is the only good deed.\nYou are forever stable, O Formless Lord! ||16||",
    "explanation": "This lengthy pauri marks a significant shift, beginning with the concept of the **'Panch' (the five accepted, distinguished ones)** – referring to spiritually elevated souls who have achieved a state of acceptance and honor in the Divine Court. Their singular focus is on God. The pauri then delves into the **boundless nature of the Creator's power**. It challenges the mythological concept of a bull supporting the Earth, stating that **Dharma (righteousness), born of compassion**, is the true support, held in place by **contentment**. Guru Nanak then expands on the vastness of creation, with countless earths and beings, all brought into existence by God's single command and written by His pen of destiny. He humbly acknowledges his own inability to fully describe God's immense power, beautiful form, and infinite gifts. The pauri concludes by reiterating that **whatever pleases God is the ultimate good deed**, and affirms God's eternal and **Formless (Nirankar)** nature. This pauri emphasizes humility, the vastness of creation, and the supremacy of God's will and power over human comprehension."
  },
  {
    "pauri_number": 19,
    "pauri_punjabi": "ਅਸੰਖ ਜਪ ਅਸੰਖ ਭਾਉ ॥\nਅਸੰਖ ਪੂਜਾ ਅਸੰਖ ਤਪ ਤਾਉ ॥\nਅਸੰਖ ਗਰੰਥ ਮੁਖਿ ਵੇਦ ਪਾਠ ॥\nਅਸੰਖ ਜੋਗ ਮਨਿ ਰਹਹਿ ਉਦਾਸ ॥\nਅਸੰਖ ਭਗਤ ਗੁਣ ਗਿਆਨ ਵੀਚਾਰ ॥\nਅਸੰਖ ਸਤੀ ਅਸੰਖ ਦਾਤਾਰ ॥\nਅਸੰਖ ਸੂਰ ਮੁਹ ਭਖ ਸਾਰ ॥\nਅਸੰਖ ਮੋਨਿ ਲਿਵ ਲਾਇ ਤਾਰ ॥\nਕੁਦਰਤਿ ਕਵਣ ਕਹਾ ਵੀਚਾਰੁ ॥\nਵਾਰਿਆ ਨ ਜਾਵਾ ਏਕ ਵਾਰ ॥\nਜੋ ਤੁਧੁ ਭਾਵੈ ਸਾਈ ਭਲੀ ਕਾਰ ॥\nਤੂ ਸਦਾ ਸਲਾਮਤਿ ਨਿਰੰਕਾਰ ॥੧੭॥",
    "transliteration": "Asankh jap asankh bhaa-o.\nAsankh poojaa asankh tap taa-o.\nAsankh granth mukh ved paath.\nAsankh jog man rahahi udaas.\nAsankh bhagat gun gi-aan veechaar.\nAsankh satee asankh daataar.\nAsankh soor muh bhakh saar.\nAsankh mon liv laae taar.\nKudrat kavan kahaa veechaar.\nVaari-aa na jaavaa ek vaar.\nJo tudh bhaavai saa-ee bhalee kaar.\nToo sadaa salaamat Nirankaar. ||17||",
    "translation": "Countless are those who meditate and chant, countless who love God.\nCountless are those who worship, countless who practice austere penances.\nCountless are those who read the scriptures and chant the Vedas from their mouths.\nCountless are the Yogis whose minds remain detached.\nCountless are the devotees who reflect on God’s virtues and wisdom.\nCountless are the truly chaste, countless are the givers.\nCountless are the brave warriors who face the steel (of battle).\nCountless are the silent sages, absorbed in deep meditation.\nWhat power do I have to describe Your wondrous ways?\nI cannot even once be a sacrifice to You.\nWhatever pleases You, that is the only good deed.\nYou are forever stable, O Formless Lord! ||17||",
    "explanation": "This pauri employs the word **'Asankh' (countless, innumerable)** to highlight the vast diversity of human spiritual and worldly practices, all undertaken in an attempt to connect with the Divine or live a virtuous life. It enumerates various paths: chanting, loving, worshipping, performing austerities, studying scriptures, practicing yoga, engaging in devotion, being chaste, giving charity, being brave warriors, and maintaining silent meditation. Despite this immense variety and number of human efforts, Guru Nanak once again expresses his inability to truly comprehend or describe God's boundless creation and power. The repeated concluding lines emphasize that **God's will is supreme** and He is the **eternal, Formless Lord**, implying that true understanding lies in surrender to His will rather than human efforts to quantify or fully grasp Him."
  },
  {
    "pauri_number": 20,
    "pauri_punjabi": "ਅਸੰਖ ਮੂਰਖ ਅੰਧ ਘੋਰ ॥\nਅਸੰਖ ਚੋਰ ਹਰਾਮਖੋਰ ॥\nਅਸੰਖ ਅਮਰ ਕਰਿ ਜਾਹਿ ਜੋਰ ॥\nਅਸੰਖ ਗਲਵਢ ਹਤਿਆ ਕਮਾਹਿ ॥\nਅਸੰਖ ਪਾਪੀ ਪਾਪੁ ਕਰਿ ਜਾਹਿ ॥\nਅਸੰਖ ਕੂੜਿਆਰ ਕੂੜੇ ਫਿਰਾਹਿ ॥\nਅਸੰਖ ਮਲੇਛ ਮਲੁ ਭਖਿ ਖਾਹਿ ॥\nਅਸੰਖ ਨਿੰਦਕ ਸਿਰਿ ਕਰਹਿ ਭਾਰੁ ॥\nਨਾਨਕੁ ਨੀਚੁ ਕਹੈ ਵੀਚਾਰੁ ॥\nਵਾਰਿਆ ਨ ਜਾਵਾ ਏਕ ਵਾਰ ॥\nਜੋ ਤੁਧੁ ਭਾਵੈ ਸਾਈ ਭਲੀ ਕਾਰ ॥\nਤੂ ਸਦਾ ਸਲਾਮਤਿ ਨਿਰੰਕਾਰ ॥੧੮॥",
    "transliteration": "Asankh moorakh andh ghor.\nAsankh chor haraamkhor.\nAsankh amar kar jaahi jor.\nAsankh galvadh hati-aa kamaahi.\nAsankh paapee paap kar jaahi.\nAsankh koorhi-aar koorhe firaahi.\nAsankh malechh mal bhakh khaahi.\nAsankh nindak sir karahi bhaar.\nNaanak neech kahai veechaar.\nVaari-aa na jaavaa ek vaar.\nJo tudh bhaavai saa-ee bhalee kaar.\nToo sadaa salaamat Nirankaar. ||18||",
    "translation": "Countless are the utterly foolish and blind.\nCountless are the thieves and embezzlers.\nCountless are those who establish their authority by force.\nCountless are the cut-throats and murderers.\nCountless are the sinners who commit sins and depart.\nCountless are the liars who wander in falsehood.\nCountless are the wretched who consume filth (spiritual impurity).\nCountless are the slanderers who carry the burden of their sins on their heads.\nNanak, the humble, offers this reflection.\nI cannot even once be a sacrifice to You.\nWhatever pleases You, that is the only good deed.\nYou are forever stable, O Formless Lord! ||18||",
    "explanation": "In stark contrast to the previous pauri, this verse uses 'Asankh' to describe the **countless varieties of negative human behaviors and spiritual failings**. It lists those who are foolish and blind (ignorant), thieves, corrupt individuals, those who rule by force, murderers, chronic sinners, liars, spiritually impure persons, and slanderers. This serves to acknowledge the pervasive presence of vice and moral decay in the world. Despite witnessing this darkness, Guru Nanak remains humble and steadfast in his devotion. The repeated concluding lines serve as a powerful affirmation of God's absolute sovereignty and eternal nature, reinforcing that **only His will is truly good**, irrespective of human actions, good or bad. It's a reminder of God's unchanging nature amidst the myriad human states."
  },
  
  {
    "pauri_number": 21,
    "pauri_punjabi": "ਅਸੰਖ ਨਾਵ ਅਸੰਖ ਥਾਵ ॥\nਅਗੰਮ ਅਗੰਮ ਅਸੰਖ ਲੋਅ ॥\nਅਸੰਖ ਕਹਹਿ ਸਿਰਿ ਭਾਰੁ ਹੋਇ ॥\nਅਖਰੀ ਨਾਮੁ ਅਖਰੀ ਸਾਲਾਹ ॥\nਅਖਰੀ ਗਿਆਨੁ ਗੀਤ ਗੁਣ ਗਾਹ ॥\nਅਖਰੀ ਲਿਖਣੁ ਬੋਲਣੁ ਬਾਣੁ ॥\nਅਖਰਾ ਸਿਰਿ ਸੰਜੋਗੁ ਵਖਾਣੁ ॥\nਜਿਨਿ ਏਹਿ ਲਿਖੇ ਤਿਸੁ ਸਿਰਿ ਨਾਹਿ ॥\nਜਿਵ ਫੁਰਮਾਏ ਤਿਵ ਤਿਵ ਪਾਹਿ ॥\nਜੇਤਾ ਕੀਤਾ ਤੇਤਾ ਨਾਉ ॥\nਵਿਣੁ ਨਾਵੈ ਨਾਹੀ ਕੋ ਥਾਉ ॥\nਕੁਦਰਤਿ ਕਵਣ ਕਹਾ ਵੀਚਾਰੁ ॥\nਵਾਰਿਆ ਨ ਜਾਵਾ ਏਕ ਵਾਰ ॥\nਜੋ ਤੁਧੁ ਭਾਵੈ ਸਾਈ ਭਲੀ ਕਾਰ ॥\nਤੂ ਸਦਾ ਸਲਾਮਤਿ ਨਿਰੰਕਾਰ ॥੧੯॥",
    "transliteration": "Asankh Naav Asankh Thaav.\nAgamm Agamm Asankh Lo-a.\nAsankh kahahi sir bhaar ho-e.\nAkhree Naam akhree saalaah.\nAkhree gi-aan geet gun gaah.\nAkhree likhan bolan baan.\nAkhraa sir sanjog vakhaan.\nJin eh likhe tis sir naahi.\nJiv furmaa-e tiv tiv paahi.\nJetaa keetaa tetaa Naa-o.\nVin Naavai naahee ko thaa-o.\nKudrat kavan kahaa veechaar.\nVaari-aa na jaavaa ek vaar.\nJo tudh bhaavai saa-ee bhalee kaar.\nToo sadaa salaamat Nirankaar. ||19||",
    "translation": "Countless are Your Names, countless Your places.\nUnreachable, unreachable, countless Your worlds.\nTo speak of all of them is to carry a burden on the head.\nIn letters is the Name, in letters is Your praise.\nIn letters is wisdom, in letters are songs of Your virtues.\nIn letters is writing, speaking, and singing.\nOn the heads of letters (by God's will), is the record of destiny.\nHe who wrote them has no destiny written upon His Head.\nAs He commands, so do beings receive.\nAs vast as Your creation, so vast is Your Name.\nWithout the Name, there is no place (nothing exists).\nWhat power do I have to describe Your wondrous ways?\nI cannot even once be a sacrifice to You.\nWhatever pleases You, that is the only good deed.\nYou are forever stable, O Formless Lord! ||19||",
    "explanation": "This pauri highlights the **infinite nature of God's Names, places, and worlds**, emphasizing their incomprehensibility to humans. It acknowledges that all human communication and knowledge, including scripture, wisdom, and destiny, are expressed through **letters and words ('Akhree')**. However, the **Creator Himself is beyond these limitations**; no destiny is written upon Him. Everything occurs according to His command. The verse then states that **God's Name is as vast as His creation**, and that **nothing exists without His Name**. The recurring refrain underscores Guru Nanak's humility and the supremacy of God's will, affirming the **Formless Lord's eternal stability**."
  },
  {
    "pauri_number": 22,
    "pauri_punjabi": "ਭਰੀਐ ਹਥੁ ਪੈਰੁ ਤਨੁ ਦੇਹ ॥\nਪਾਣੀ ਧੋਤੈ ਉਤਰਸੁ ਖੇਹ ॥\nਮੂਤ ਪਲੀਤੀ ਕਪੜੁ ਹੋਇ ॥\nਦੇ ਸਾਬੂਣੁ ਲਈਐ ਓਹੁ ਧੋਇ ॥\nਭਰੀਐ ਮਤਿ ਪਾਪਾ ਕੈ ਸੰਗਿ ॥\nਓਹੁ ਧੋਪੈ ਨਾਵੈ ਕੈ ਰੰਗਿ ॥\nਪੁੰਨੀ ਪਾਪੀ ਆਖਣੁ ਨਾਹਿ ॥\nਕਰਿ ਕਰਿ ਕਰਣਾ ਲਿਖਿ ਲੈ ਜਾਹੁ ॥\nਆਪੇ ਬੀਜਿ ਆਪੇ ਹੀ ਖਾਹੁ ॥\nਨਾਨਕ ਹੁਕਮੀ ਆਵਹੁ ਜਾਹੁ ॥੨੦॥",
    "transliteration": "Bharee-ai hath pair tan deh.\nPaanee dhotai utras kheh.\u2028Moot paleetee kaparh ho-e.\nDe saabooN la-ee-ai oh dho-e.\nBharee-ai mat paapaa kai sang.\nOh dhopai Naavai kai rang.\nPunnee paapee aakhan naahi.\nKar kar karnaa likh lai jaahu.\nAape beej aape hee khaahu.\nNaanak hukmee aavahu jaahu. ||20||",
    "translation": "When the hands, feet, and body are stained,\nWater washes away the dirt.\nWhen the clothes become polluted with urine,\nThey are washed clean with soap.\nBut when the intellect is stained by sin,\nIt is cleansed by the Dye of the Naam (Name of God).\nOne does not become virtuous or sinful just by speaking.\nActions performed are inscribed and taken along (after death).\nAs you sow, so shall you eat.\nO Nanak, by His Command, you come and go (in reincarnation). ||20||",
    "explanation": "This pauri uses simple analogies to distinguish between physical and spiritual cleansing. It states that just as water cleanses physical dirt and soap cleanses dirty clothes, so too is the **intellect, when stained by sin, purified by the 'Dye of the Naam' (God's Name)**. It then moves to the crucial concept of **karma**, stating that one is not determined good or bad by mere words, but by their **actions ('karnaa')**, which are recorded and carried with the soul. The universal law of **'as you sow, so shall you reap'** is asserted. The pauri concludes by reaffirming that the cycle of birth and death is also subject to **God's Command ('Hukam')**, tying human actions and their consequences back to the Divine Will."
  },
  {
    "pauri_number": 23,
    "pauri_punjabi": "ਤੀਰਥੁ ਤਪੁ ਦਇਆ ਦਤੁ ਦਾਨੁ ॥\nਜੇ ਕੋ ਪਾਵੈ ਤਿਲ ਕਾ ਮਾਨੁ ॥\nਸੁਣਿਆ ਮੰਨਿਆ ਮਨਿ ਕੀਤਾ ਭਾਉ ॥\nਅੰਤਰਗਤਿ ਤੀਰਥਿ ਮਲੁ ਨਾਉ ॥\nਸਭਿ ਗੁਣ ਤੇਰੇ ਮੈ ਨਾਹੀ ਕੋਇ ॥\nਵਿਣੁ ਗੁਣ ਕੀਤੇ ਭਗਤਿ ਨ ਹੋਇ ॥\nਸੁਅਸਤਿ ਆਥਿ ਬਾਣੀ ਬਰਮਾਉ ॥\nਸਤਿ ਸੁਹਾਣੁ ਸਦਾ ਮਨਿ ਚਾਉ ॥\nਕਵਣੁ ਸੁ ਵੇਲਾ ਵਖਤੁ ਕਵਣੁ ਕਵਣ ਥਿਤਿ ਕਵਣੁ ਵਾਰੁ ॥\nਕਵਣਿ ਸਿ ਰੁਤੀ ਮਾਹੁ ਕਵਣੁ ਜਿਤੁ ਹੋਆ ਆਕਾਰੁ ॥\nਵੇਲ ਨ ਪਾਈਆ ਪੰਡਤੀ ਜਿ ਹੋਵੈ ਲੇਖੁ ਪੁਰਾਣੁ ॥\nਵਖਤੁ ਨ ਪਾਇਓ ਕਾਦੀਆ ਜਿ ਲਿਖਨਿ ਲੇਖੁ ਕੁਰਾਣੁ ॥\nਥਿਤਿ ਵਾਰੁ ਨ ਜੋਗੀ ਜਾਣੈ ਰੁਤਿ ਮਾਹੁ ਨ ਕੋਈ ॥\nਜਾ ਕਰਤਾ ਸਿਰਠੀ ਕਉ ਸਾਜੇ ਆਪੇ ਜਾਣੈ ਸੋਈ ॥\nਕਿਵ ਕਰਿ ਆਖਾ ਕਿਵ ਸਾਲਾਹੀ ਕਿਉ ਵਰਨਾ ਕਿਵ ਜਾਣਾ ॥\nਨਾਨਕ ਆਖਣਿ ਸਭੁ ਕੋ ਆਖੈ ਇਕ ਦੂ ਇਕੁ ਸਿਆਣਾ ॥\nਵਡਾ ਸਾਹਿਬੁ ਵਡੀ ਨਾਈ ਕੀਤਾ ਕਾ ਜਾ ਕਾ ਹੋਵੈ ॥\nਨਾਨਕ ਜੇ ਕੋ ਆਪੌ ਜਾਣੈ ਅਗੈ ਗਇਆ ਨ ਸੋਹੈ ॥੨੧॥",
    "transliteration": "Teerath tap da-i-aa dat daan.\nJe ko paavai til kaa maan.\nSuni-aa manni-aa man keetaa bhaa-o.\nAntargat teerath mal naa-o.\nSabh gun tere mai naahee ko-e.\nVin gun keete bhagat na ho-e.\nSu-asath aath baanee barma-o.\nSat suhaN sadaa man chaa-o.\nKavan su velaa vakhat kavan kavan thit kavan vaar.\nKavan si rutee maahu kavan jit ho-aa aakaar.\nVel na paa-ee-aa pandtee je hovai lekh puraan.\nVakhat na paa-i-o kaadee-aa je likhan lekh kuraan.\nThit vaar na jogee jaanai rut maahu na ko-ee.\nJaa kartaa sirthee ka-o saaje aape jaanai so-ee.\nKiv kar aakhaa kiv saalaahee ki-o varna kiv jaanaa.\nNaanak aakhan sabh ko aakhai ik doo ik si-aana.\nVadaa Saahib vadee naa-ee keetaa kaa jaa kaa hovai.\nNaanak je ko aapau jaanai agai ga-i-aa na sohai. ||21||",
    "translation": "Pilgrimage, austere discipline, compassion, and charity—\nIf anyone receives even a tiny bit of honor from these.\nBut by listening, believing, and cherishing love in the heart,\nOne bathes in the sacred shrine of the inner self and washes away filth.\nAll virtues are Yours, I have none.\nWithout virtues, devotional worship cannot be performed.\nHail to the Creator, whose Word is the Vedas.\nTruth is beautiful, and my mind is forever joyous.\nWhat was that time, what was that moment, what was that lunar day, what was that week day?\nWhat was that season, what was that month, when the universe was created?\nNo Pundit (scholar) found that time, even if it were written in the Puranas.\nNo Qazi (Islamic judge/scholar) found that time, even if it were written in the Quran.\nNo Yogi knows the lunar day, the week day, the season, or the month.\nOnly the Creator, who fashioned the creation, knows that time Himself.\nHow can I speak of Him? How can I praise Him? How can I describe Him? How can I know Him?\nO Nanak, everyone speaks, each one claiming to be wiser than the next.\nGreat is the Lord, and great is His Name; whatever He does, that comes to pass.\nO Nanak, if anyone thinks they know Him by themselves, they will not be honored in the world hereafter. ||21||",
    "explanation": "This profound pauri explores the relative value of various spiritual practices. It states that while external practices like **pilgrimage, austerities, compassion, and charity** may grant some worldly recognition, true purification comes from **listening, believing, and cultivating love for God within the heart**, which is likened to bathing in the sacred shrine of the inner self. Guru Nanak expresses his humility, acknowledging that all virtues belong to God and without them, true devotion is impossible. He then praises the Creator whose **'Bani' (Word)** is the essence of all scriptures. A significant portion of this pauri then delves into the **unknowability of the time of creation**. Neither Hindu Pundits with their Puranas nor Muslim Qazis with their Quran, nor Yogis, can ascertain the exact moment of creation; **only the Creator Himself knows**. Guru Nanak then humbly questions his own capacity to describe or know God, observing that everyone claims wisdom. The pauri concludes by reiterating God's greatness and the certainty of His will. It cautions against **ego ('aapau jaanai')** and self-proclaimed knowledge, emphasizing that such arrogance will not be honored in the afterlife. This verse powerfully reinforces God's omnipotence and the futility of human attempts to fully grasp His mysteries through intellect alone."
  },
  {
    "pauri_number": 24,
    "pauri_punjabi": "ਪਾਤਾਲਾ ਪਾਤਾਲ ਲਖ ਆਗਾਸਾ ਆਗਾਸ ॥\nਓੜਕ ਓੜਕ ਭਾਲਿ ਥਕੇ ਵੇਦ ਕਹਨਿ ਇਕ ਵਾਤ ॥\nਸਹਸ ਅਠਾਰਹ ਕਹਨਿ ਕਤੇਬਾ ਅਸੁਲੂ ਇਕ ਧਾਤੁ ॥\nਲੇਖਾ ਹੋਇ ਤ ਲਿਖੀਐ ਲੇਖੈ ਹੋਇ ਵਿਣਾਸੁ ॥\nਨਾਨਕ ਵਡਾ ਆਖੀਐ ਆਪੇ ਜਾਣੈ ਆਪੁ ॥੨੨॥",
    "transliteration": "Paataalaa paataal lakh aagaasaa aagaas.\nOrhak orhak bhaali thake ved kahani ik vaat.\nSahas athaarh kahan katebaa asuloo ik dhaat.\nLekhaa ho-e ta likhee-ai lekhai ho-e vinaas.\nNaanak vadaa aakhee-ai aape jaanai aap. ||22||",
    "translation": "There are hundreds of thousands of nether worlds below, and skies above skies.\nExplorers have searched to their limits and grown weary, while the Vedas speak of only one reality.\nThe Semitic scriptures speak of eighteen thousand worlds, but the ultimate reality is One Principle.\nIf there were a count, it could be written, but the count itself would be consumed.\nO Nanak, call Him Great; He Himself knows Himself. ||22||",
    "explanation": "This pauri emphasizes the **immeasurable vastness of God's creation**. It speaks of countless lower and upper realms ('paataalaa paataal lakh aagaasaa aagaas'), highlighting that seekers and scriptures (Vedas and Semitic texts like the Quran and Bible) have tried to define the limits of creation, but even their descriptions are limited. The Vedas might speak of 'one reality', and other scriptures of 'eighteen thousand worlds', but the underlying principle is always the **One God**. The verse asserts that if creation could be counted, it would be written down, but its very vastness implies that any attempt at enumeration would be overwhelmed and consumed. The conclusion is that God is too great to be fully known by human intellect; **He alone knows Himself**. This underscores His transcendence and the futility of trying to limit Him through human categorization."
  },
  {
    "pauri_number": 25,
    "pauri_punjabi": "ਸਾਲਾਹੀ ਸਾਲਾਹਿ ਏਤੀ ਸੁਰਤਿ ਨ ਪਾਈਆ ॥\nਨਦੀਆ ਅਤੈ ਵਾਹ ਪਵਹਿ ਸਮੁੰਦਿ ਨ ਜਾਣੀਅਹਿ ॥\nਸਮੁੰਦ ਸਾਹ ਸੁਲਤਾਨ ਗਿਰਹਾ ਸੇਤੀ ਮਾਲੁ ਧਨੁ ॥\nਕੀੜੀ ਤੁਲਿ ਨ ਹੋਵਨੀ ਜੇ ਤਿਸੁ ਨਦਰਿ ਨ ਆਵਨੀ ॥੨੩॥",
    "transliteration": "Saalaahee saalaahi etee surat na paa-ee-aa.\nNadee-aa atai vaah pavahi samund na jaanee-ah.\nSamund Saah Sultan girhaa setee maal dhan.\nKeerhee tul na hovnee je tis nadar na aavnee. ||23||",
    "translation": "Even if we praise Him, praising Him, we cannot attain such understanding.\nRivers and streams flow into the ocean, but they do not know its expanse.\nEven kings and emperors, with mountains of wealth and property,\nAre not equal to an ant, if they do not receive His Glance of Grace. ||23||",
    "explanation": "This pauri reiterates the idea that **God's greatness is beyond full human comprehension**, even through constant praise. It uses the analogy of **rivers flowing into the ocean**; just as the rivers do not grasp the ocean's immensity, so too human praise cannot fully encompass God's vastness. The verse then employs a powerful comparison: even the mightiest **kings and emperors, with all their immense wealth**, are less than an **ant** if they do not receive **God's Gracious Glance ('Nadar')**. This highlights that all worldly power and riches are trivial without divine grace, emphasizing the supremacy of God's benevolent favor over all material possessions and human status."
  },
  {
    "pauri_number": 26,
    "pauri_punjabi": "ਅੰਤੁ ਨ ਸਿਫਤੀ ਕਹਣਿ ਨ ਅੰਤੁ ॥\nਅੰਤੁ ਨ ਕਰਣੈ ਦੇਣਿ ਨ ਅੰਤੁ ॥\nਅੰਤੁ ਨ ਵੇਖਣਿ ਸੁਣਣਿ ਨ ਅੰਤੁ ॥\nਅੰਤੁ ਨ ਜਾਪੈ ਕਿਆ ਮਨਿ ਮੰਤੁ ॥\nਅੰਤੁ ਨ ਜਾਪੈ ਕੀਤਾ ਆਕਾਰੁ ॥\nਅੰਤੁ ਨ ਜਾਪੈ ਪਾਰਾਵਾਰੁ ॥\nਅੰਤ ਕਾਰਣਿ ਕੇਤੇ ਬਿਲਲਾਹਿ ॥\nਤਾ ਕੇ ਅੰਤ ਨ ਪਾਏ ਜਾਹਿ ॥\nਏਹੁ ਅੰਤੁ ਨ ਜਾਣੈ ਕੋਇ ॥\nਬਹੁਤਾ ਕਹੀਐ ਬਹੁਤਾ ਹੋਇ ॥\nਵਡਾ ਸਾਹਿਬੁ ਊਚਾ ਥਾਉ ॥\nਊਚੇ ਉਪਰਿ ਊਚਾ ਨਾਉ ॥\nਏਵਡੁ ਊਚਾ ਹੋਵੈ ਕੋਇ ॥\nਤਿਸੁ ਊਚੇ ਕਉ ਜਾਣੈ ਸੋਇ ॥\nਜੇਵਡੁ ਆਪਿ ਜਾਣੈ ਆਪਿ ਆਪਿ ॥\nਨਾਨਕ ਨਦਰੀ ਕਰਮੀ ਦਾਤਿ ॥੨੪॥",
    "transliteration": "Ant na siftee kahan na ant.\nAnt na karnai den na ant.\nAnt na vekhan sunan na ant.\nAnt na jaapai ki-aa man mant.\nAnt na jaapai keetaa aakaar.\nAnt na jaapai paaraavaar.\nAnt kaaran kete billaahi.\nTaa ke ant na paa-e jaahi.\nEh ant na jaanai ko-e.\nBahutaa kahee-ai bahutaa ho-e.\nVadaa Saahib oochaa thaa-o.\nOoche upar oochaa Naa-o.\nEvad oochaa hovai ko-e.\nTisu ooche ka-o jaanai so-e.\nJevad Aap jaanai Aap Aap.\nNaanak nadaree karmee daat. ||24||",
    "translation": "There is no end to His praises, no end to speaking of Him.\nThere is no end to His doing, no end to His giving.\nThere is no end to His seeing, no end to His hearing.\nHis inner counsel and wisdom cannot be known.\nThere is no end to His created universe.\nThere is no end to His limits or boundaries.\nMany cry out to know His limits,\nBut His limits cannot be found.\nNo one knows these limits.\nThe more you speak of them, the more there are.\nGreat is the Lord, and exalted is His dwelling place.\nSublimely exalted is His Name.\nIf someone were to be as great as He is,\nOnly then could they know that Exalted One.\nAs Great as He is, He Himself knows His own greatness.\nO Nanak, by His Glance of Grace, one receives gifts. ||24||",
    "explanation": "This pauri strongly emphasizes the **infinite and boundless nature of God**. It uses the word **'Ant' (end/limit)** repeatedly to state that there is no end to His praises, actions, gifts, seeing, hearing, inner wisdom, created universe, or boundaries. Many try to find His limits, but they remain undiscovered. The more one attempts to describe Him, the more His vastness becomes apparent. God is depicted as the **Great Lord, with an exalted dwelling and an even more exalted Name**. The only one who can truly know God's greatness is someone as great as He is, which is impossible for humans. Therefore, **only God Himself truly knows His own vastness**. The pauri concludes by reiterating that all **spiritual gifts and blessings are received through God's Grace ('Nadar') and divine will ('Karmee')**, not through human effort to comprehend His infinitude."
  },
  {
    "pauri_number": 27,
    "pauri_punjabi": "ਬਹੁਤਾ ਕਰਮੁ ਲਿਖਿਆ ਨਾ ਜਾਇ ॥\nਵਡਾ ਦਾਤਾ ਤਿਲੁ ਨ ਤਮਾਇ ॥\nਕੇਤੇ ਮੰਗਹਿ ਜੋਧ ਅਪਾਰ ॥\nਕੇਤਿਆ ਗਣਤ ਨਹੀ ਵੀਚਾਰੁ ॥\nਕੇਤੇ ਖਪਿ ਤੁਟਹਿ ਵੇਕਾਰ ॥\nਕੇਤੇ ਲੈ ਲੈ ਮੁਕਰੁ ਪਾਹਿ ॥\nਕੇਤੇ ਮੂਰਖ ਖਾਹੀ ਖਾਹਿ ॥\nਕੇਤਿਆ ਦੂਖ ਭੂਖ ਸਦ ਮਾਰ ॥\nਏਹਿ ਭਿ ਦਾਤਿ ਤੇਰੀ ਦਾਤਾਰ ॥\nਬੰਦਿ ਖਲਾਸੀ ਭਾਣੈ ਹੋਇ ॥\nਹੋਰੁ ਆਖਿ ਨ ਸਕੈ ਕੋਇ ॥\nਜੇ ਕੋ ਖਾਇਕੁ ਆਖਣਿ ਪਾਇ ॥\nਓਹੁ ਜਾਣੈ ਜੇਤੀਆ ਮੁਹਿ ਖਾਇ ॥\nਆਪੇ ਜਾਣੈ ਆਪੇ ਦੇਇ ॥\nਆਖਹਿ ਸਿ ਭਿ ਕੇਈ ਕੇਇ ॥\nਜਿਸ ਨੋ ਬਖਸੇ ਸਿਫਤਿ ਸਾਲਾਹ ॥\nਨਾਨਕ ਪਾਤਿਸਾਹੀ ਪਾਤਿਸਾਹੁ ॥੨੫॥",
    "transliteration": "Bahutaa karam likhi-aa na jaae.\nVadaa Daataa til na tamaa-e.\nKete mangahi jodh apaar.\nKeti-aa ganat nahee veechaar.\nKete khap tutahi vekaar.\nKete lai lai mukar paahi.\nKete moorakh khaahee khaahi.\nKeti-aa dookh bhookh sad maar.\nEh bhi daat teree Daataar.\nBand khalaasee bhaNai ho-e.\nHor aakh na sakai ko-e.\nJe ko khaa-ik aakhan paae.\nOh jaanai jetee-aa muh khaae.\nAape jaanai aape de-e.\nAakhahi si bhi ke-ee ke-e.\nJis no bakhse sifat saalaah.\nNaanak Paatisaahee Paatisaah. ||25||",
    "translation": "His great blessings cannot be written.\nHe is the Great Giver, not even a tiny bit greedy.\nSo many mighty warriors beg from Him.\nSo many whose number and thoughts cannot be counted.\nSo many waste away, consumed by their vices.\nSo many receive, and then deny receiving.\nSo many fools simply eat and eat.\nSo many suffer pain, hunger, and constant torment.\nO Giver, even these are Your gifts (due to His Hukam).\nFreedom from bondage comes by His Will.\nNo one else can utter it.\nIf a fool tries to speak (of His gifts as if they were his own),\nHe knows how many blows he will receive in his mouth.\nHe Himself knows, He Himself gives.\nVery few speak of this.\nUpon whom He bestows the gift of His praise and glory,\nO Nanak, He is the King of kings. ||25||",
    "explanation": "This pauri emphasizes the **boundless generosity of God ('Vadaa Daataa')** and His lack of any desire or greed. It speaks of countless beings who beg from Him, both the powerful and the innumerable. It also highlights the diverse states of humanity: those consumed by vice, those who deny receiving His gifts, those who indulge excessively, and those who suffer constant pain and hunger. Remarkably, Guru Nanak states that **even these diverse conditions (including suffering) are also His gifts**, implying they are part of His divine plan or 'Hukam'. The pauri reiterates that **liberation from bondage comes only by God's Will ('BhaNai')**. It cautions against anyone claiming to understand or speak for God's giving, implying such arrogance would lead to rebuke. Ultimately, **God Himself knows and gives**, and only those **blessed by Him with the gift of praise** truly understand His nature. The pauri concludes by calling God the **'King of kings' (Paatisaahee Paatisaah)**, affirming His supreme sovereignty and generosity."
  },
  {
    "pauri_number": 28,
    "pauri_punjabi": "ਅਮੁਲ ਗੁਣ ਅਮੁਲ ਵਾਪਾਰ ॥\nਅਮੁਲ ਵਾਪਾਰੀਏ ਅਮੁਲ ਭੰਡਾਰ ॥\nਅਮੁਲ ਆਵਹਿ ਅਮੁਲ ਲੈ ਜਾਹਿ ॥\nਅਮੁਲ ਭਾਇ ਅਮੁਲਾ ਸਮਾਹਿ ॥\nਅਮੁਲੁ ਧਰਮੁ ਅਮੁਲੁ ਦੀਬਾਣੁ ॥\nਅਮੁਲੁ ਤੁਲੁ ਅਮੁਲੁ ਪਰਵਾਣੁ ॥\nਅਮੁਲੁ ਕਰਮੁ ਅਮੁਲੁ ਫੁਰਮਾਣੁ ॥\nਅਮੁਲੋ ਅਮੁਲੁ ਆਖਿਆ ਨ ਜਾਇ ॥\nਆਖਿ ਆਖਿ ਰਹੇ ਲਿਵ ਲਾਇ ॥\nਤੋਲਿ ਤੋਲਿ ਨਾ ਤੋਲਿਆ ਜਾਇ ॥\nਵਖਰ ਏਵਡੁ ਰਹੇ ਸਮਾਇ ॥\nਨਾਨਕ ਜਿਨ ਕੈ ਭਾਗਿ ਨਾਮੁ ॥\nਅਨਦਿਨੁ ਨਾਮੁ ਸਚਾ ਪਤਿ ਸਾਚਾ ॥੨੬॥",
    "transliteration": "Amul gun amul vaapaar.\nAmul vaapaaree-e amul bhandaar.\nAmul aavahi amul lai jaahi.\nAmul bhaa-e amulaa samaahi.\nAmul Dharam amul deebaan.\nAmul tul amul parvaan.\nAmul karam amul furmaan.\nAmulo amul aakhi-aa na jaae.\nAakh aakh rahe liv laae.\nToli toli naa toli-aa jaae.\nVakhar evad rahe samaa-e.\nNaanak jin kai bhaag Naam.\nAn-din Naam Sachaa Pat Saachaa. ||26||",
    "translation": "Priceless are His virtues, priceless His commerce.\nPriceless are the merchants, priceless His stores.\nPriceless are those who come, priceless those who go.\nPriceless is His love, priceless those who merge in Him.\nPriceless is His Righteousness, priceless His Court.\nPriceless is His balance, priceless His measure.\nPriceless is His Grace, priceless His Command.\nPriceless, priceless, beyond all description.\nSpeakers speak, absorbed in meditation, but cannot describe Him.\nWeighers weigh, but cannot weigh Him.\nSuch is the vastness of this merchandise (of the Name) that it fills everything.\nO Nanak, those who are blessed with the Name in their destiny,\nMeditate on the Name, the True Name, the True Master, day and night. ||26||",
    "explanation": "This pauri extensively uses the word **'Amul' (priceless, invaluable, beyond measure)** to describe various aspects of God and His creation. It highlights the pricelessness of His **virtues, the spiritual 'commerce' of divine love, the devotees who engage in it, and His boundless stores of grace**. It extends to His **righteousness, divine court, justice (balance and measure), grace, and command**. The central message is that God is **'Amulo Amul' – utterly priceless and beyond all description and measurement**. Despite endless attempts by seekers to describe Him, He remains incomprehensible in His totality. The verse concludes by stating that those **destined by grace to receive the Naam (Name of God)** find true fulfillment by meditating on it day and night, affirming the **True Name and the True Master** as the ultimate reality."
  },
  {
    "pauri_number": 29,
    "pauri_punjabi": "ਸੋ ਦਰੁ ਕੇਹਾ ਸੋ ਘਰੁ ਕੇਹਾ ਜਿਤੁ ਬਹਿ ਸਰਬ ਸਮਾਲੇ ॥\nਵਾਜੇ ਨਾਦ ਅਨੇਕ ਅਸੰਖਾ ਕੇਤੇ ਵਾਵਣਹਾਰੇ ॥\nਕੇਤੇ ਰਾਗ ਪਰੀ ਸਿਉ ਕਹੀਅਨਿ ਕੇਤੇ ਗਾਵਣਹਾਰੇ ॥\nਗਾਵਹਿ ਤੁਹਨੋ ਪਉਣੁ ਪਾਣੀ ਬੈਸੰਤਰੁ ਗਾਵੈ ਰਾਜਾ ਧਰਮੁ ਦੁਆਰੇ ॥\nਗਾਵਹਿ ਚਿਤੁ ਗੁਪਤੁ ਲਿਖਿ ਜਾਣਹਿ ਲਿਖਿ ਲਿਖਿ ਧਰਮੁ ਵੀਚਾਰੇ ॥\nਗਾਵਹਿ ਈਸਰੁ ਬਰਮਾ ਦੇਵੀ ਸੋਹਨਿ ਤੇਰੇ ਸਦਾ ਸਵਾਰੇ ॥\nਗਾਵਹਿ ਇੰਦ ਇੰਦਾਸਣਿ ਬੈਠੇ ਦੇਵਤਿਆ ਦਰਿ ਨਾਲੇ ॥\nਗਾਵਹਿ ਸਿਧ ਸਮਾਧੀ ਅੰਦਰਿ ਗਾਵਨਿ ਸਾਧ ਵਿਚਾਰੇ ॥\nਗਾਵਨਿ ਜਤੀ ਸਤੀ ਸੰਤੋਖੀ ਗਾਵਹਿ ਵੀਰ ਕਰਾਰੇ ॥\nਗਾਵਨਿ ਪੰਡਿਤ ਪੜਨਿ ਰਖੀਸਰ ਜੁਗੁ ਜੁਗੁ ਵੇਦਾ ਨਾਲੇ ॥\nਗਾਵਹਿ ਮੋਹਣੀਆ ਮਨੁ ਮੋਹਨਿ ਸੁਰਗੁ ਮਛੁ ਪਇਆਲੇ ॥\nਗਾਵਨਿ ਰਤਨ ਉਪਾਏ ਤੇਰੇ ਅਠਸਠਿ ਤੀਰਥ ਨਾਲੇ ॥\nਗਾਵਹਿ ਜੋਧ ਮਹਾਬਲ ਸੂਰਾ ਗਾਵਹਿ ਖਾਣੀ ਚਾਰੇ ॥\nਗਾਵਹਿ ਖੰਡ ਮੰਡਲ ਵਰਭੰਡਾ ਕਰਿ ਕਰਿ ਰਖੇ ਧਾਰੇ ॥\nਸੇਈ ਤੁਧੁਨੋ ਗਾਵਹਿ ਜੋ ਤੁਧੁ ਭਾਵਨਿ ਰਤੇ ਤੇਰੇ ਭਗਤ ਰਸਾਲੇ ॥\nਹੋਰਿ ਕੇਤੇ ਗਾਵਨਿ ਸੇ ਮੈ ਚਿਤਿ ਨ ਆਵਨਿ ਨਾਨਕੁ ਕਹੈ ਵੀਚਾਰੇ ॥\nਜੋ ਤਿਸੁ ਭਾਵੈ ਸੋਈ ਕਰਸੀ ਹੁਕਮੁ ਨ ਕਰਣਾ ਜਾਈ ॥\nਸੋ ਪਾਤਿਸਾਹੁ ਸਾਹਾ ਪਾਤਿਸਾਹਿਬੁ ਨਾਨਕ ਰਹਣੁ ਰਜਾਈ ॥੨੭॥",
    "transliteration": "So Dar kehaa so Ghar kehaa jit bah sarab samaale.\nVaaje Naad anek asankhaa kete vaavanhaare.\nKete Raag paree si-o kahee-an kete gaavanhaare.\nGaavahi tuhno pa-un paanee baisantar gaavai Raajaa Dharam duaare.\nGaavahi Chit Gupt likh jaanahi likh likh Dharam veechaare.\nGaavahi Eesar Barmaa Devee sohni tere sadaa savaare.\nGaavahi Ind Indaasan baithhe devti-aa dar naale.\nGaavahi Sidh samaadhee andar gaavan saadh veechaare.\nGaavan jatee satee santokhee gaavahi veer karaare.\nGaavan pandit paran rakheesar jug jug vedaa naale.\nGaavahi mohanee-aa man mohan surag machh pa-i-aale.\nGaavan ratan upaa-e tere athsath teerath naale.\nGaavahi jodh mahaabal sooraa gaavahi khaanee chaare.\nGaavahi khand mandal varbhandaa kar kar rakhe dhaare.\nSe-ee tudhuno gaavahi jo tudh bhaavan rate tere bhagat rasaale.\nHore kete gaavan se mai chit na aavan Naanak kahai veechaare.\nJo tis bhaavai so-ee karsee hukam na karnaa jaa-ee.\nSo Paatisaahu saahaa paatisaahib Naanak rahan rajaa-ee. ||27||",
    "translation": "How great is that Door, and how great is that House, where You sit and take care of all!\nInnumerable are the musical instruments and melodies played there, and countless are the players.\nInnumerable are the ragas (melodies) with their consorts, and countless are the singers.\nThe air, water, and fire sing of You; the Righteous Judge, Dharmaraj, sings at Your Door.\nChitra and Gupt (scribes of deeds) sing of You, who know how to record and judge righteousness.\nShiva, Brahma, and the Goddesses sing of You, forever beautiful in Your creations.\nIndra, seated on his throne, sings of You, along with the demi-gods at Your Door.\nThe Siddhas (perfected ones) sing of You in their meditative trance; the humble sages sing of You.\nThe celibates, the chaste, the content, and the mighty warriors sing of You.\nThe Pandits (scholars) who read and the great Rishis (sages) of the ages, along with the Vedas, sing of You.\nThe enchanting beauties who enthrall the mind, in heaven, on earth, and in the nether regions, sing of You.\nThe jewels created by You, along with the sixty-eight sacred shrines, sing of You.\nThe mighty warriors and powerful heroes sing of You; the four sources of creation sing of You.\nThe continents, solar systems, and universes, created and established by You, sing of You.\nOnly those sing of You who are pleasing to You, immersed in Your sweet devotion, Your loving devotees.\nMany others sing, but they do not come to my mind; Nanak speaks this reflection.\nWhatever pleases Him, that alone He does; His Command cannot be overruled.\nHe is the King of kings, the Supreme Sovereign; O Nanak, live according to His Will. ||27||",
    "explanation": "This lengthy and majestic pauri is a grand hymn of praise, describing the **countless forms of creation that sing praises to God**. It begins by asking about the nature of God's 'Door' and 'House' from where He sustains all. It then enumerates various aspects of existence that sing of Him: musical instruments and melodies, the fundamental elements (air, water, fire), the **Lord of Righteousness (Dharamraj)**, the celestial scribes (Chitra and Gupt), various deities (Shiva, Brahma, Goddesses, Indra), spiritual practitioners (Siddhas, sages, celibates, chaste, content, warriors), scholars (Pandits, Rishis, Vedas), celestial beauties, the earth's jewels, pilgrimage sites, heroic figures, the **four sources of creation (from egg, womb, sweat, earth)**, and all the cosmic realms (continents, planets, universes). The pauri emphasizes that **only those who are pleasing to God, His loving devotees, truly sing His praises**. It ends by stating that many others sing, but they are beyond Guru Nanak's count. The powerful conclusion reiterates that **God's will is supreme and cannot be overruled**, and that He is the **King of kings**. The ultimate message is to **live in accordance with His divine will ('Rahan Raja-ee')**."
  },

  {
    "pauri_number": 30,
    "pauri_punjabi": "ਮੁੰਦਾ ਸੰਤੋਖੁ ਸਰਮੁ ਪਤੁ ਝੋਲੀ ਧਿਆਨ ਕੀ ਕਰਹਿ ਬਿਭੂਤਿ ॥\nਖਿੰਥਾ ਕਾਲ ਕੁਆਰੀ ਕਾਇਆ ਜੁਗਤਿ ਡੰਡਾ ਪਰਤੀਤਿ ॥\nਆਈ ਪੰਥੀ ਸਗਲ ਜਮਾਤੀ ਮਨਿ ਜੀਤੈ ਜਗੁ ਜੀਤੁ ॥\nਆਦੇਸੁ ਤਿਸੈ ਆਦੇਸੁ ॥\nਆਦਿ ਅਨੀਲੁ ਅਨਾਦਿ ਅਨਾਹਤਿ ਜੁਗੁ ਜੁਗੁ ਏਕੋ ਵੇਸੁ ॥੨੮॥",
    "transliteration": "Munda santokh saram pat jholee dhi-aan kee karahi bibhoot.\nKhinthhaa kaal kuaaree kaa-i-aa jugat dandaa parteet.\nA-ee panthee sagal jamaatee man jeetai jag jeet.\nAades tisai aades.\nAad aneel anaad anaahat jug jug eko ves. ||28||",
    "translation": "Let contentment be your ear-rings, modesty your begging bowl and pouch, and meditation the ashes you apply.\nLet the thought of death be your patched coat, the chastity of your body your way, and faith your staff.\nLet the A-i Panth (the highest Yogi sect) be all humankind, and conquering your mind be the conquest of the world.\nI bow to Him, I humbly bow.\nThe Primal One, the Pure One, without beginning, without end, remaining the same through all ages. ||28||",
    "explanation": "This pauri adopts the terminology of **Yoga and asceticism** but redefines them spiritually. Guru Nanak transforms the external symbols of a Yogi into internal virtues: **contentment** becomes the ear-rings, **modesty** the begging bowl, and **meditation** the ashes smeared on the body. The awareness of **death (mortality)** becomes the patched cloak, **chastity** the true yogic discipline, and **faith** the staff. The highest 'Panth' (sect) is then declared to be **all humanity**, and the ultimate victory is not over the world but over one's own **mind ('man jeetai jag jeet')**. The pauri concludes with a profound salutation: **'Aades' (I bow)** to the Primal, Pure, Beginningless, and Indestructible Lord who remains eternally the same. This verse emphasizes inner transformation and universal brotherhood over outward ritualism and sectarianism."
  },
  {
    "pauri_number": 31,
    "pauri_punjabi": "ਭੁਗਤਿ ਗਿਆਨੁ ਦਇਆ ਭੰਡਾਰਣਿ ਘਟਿ ਘਟਿ ਵਾਜਹਿ ਨਾਦ ॥\nਆਪਿ ਨਾਥੁ ਨਾਥੀ ਸਭ ਜਾ ਕੀ ਰਿਧਿ ਸਿਧਿ ਅਵਰਾ ਸਾਦ ॥\nਸੰਜੋਗੁ ਵਿਜੋਗੁ ਦੁਇ ਕਾਰ ਚਲਾਵਹਿ ਲੇਖੇ ਆਵਹਿ ਭਾਗ ॥\nਆਦੇਸੁ ਤਿਸੈ ਆਦੇਸੁ ॥\nਆਦਿ ਅਨੀਲੁ ਅਨਾਦਿ ਅਨਾਹਤਿ ਜੁਗੁ ਜੁਗੁ ਏਕੋ ਵੇਸੁ ॥੨੯॥",
    "transliteration": "Bhugat gi-aan da-i-aa bhandaaran ghat ghat vaajahi Naad.\nAap naath naathee sabh jaa kee ridh sidh avraa saad.\nSanjog vijog du-e kaar chalaavahi lekhe aavahi bhaag.\nAades tisai aades.\nAad aneel anaad anaahat jug jug eko ves. ||29||",
    "translation": "Let spiritual knowledge be your food, and compassion your dispenser; in every heart, the Divine Melody resounds.\nHe Himself is the Master, over all He casts His power; spiritual powers and miraculous attainments are just other tastes.\nUnion and separation are the two ways by which He runs the world; by destiny, destinies are received.\nI bow to Him, I humbly bow.\nThe Primal One, the Pure One, without beginning, without end, remaining the same through all ages. ||29||",
    "explanation": "This pauri continues the spiritual reinterpretation of yogic concepts. **Spiritual knowledge ('giaan')** is the true sustenance, and **compassion ('da-i-aa')** is the dispenser of this food. The **Divine Melody ('Naad')** is not just heard externally but resonates within every heart. God is the ultimate **Master ('Naath')** who controls everything; all miraculous powers ('ridh sidh') are secondary and merely distractions. The universe operates on the principle of **'Sanjog' (union)** and **'Vijog' (separation)**, and individuals receive their destinies according to their karma. The pauri concludes with the same reverential salutation to the **eternal, unchanging, Primal Lord**, reinforcing His supreme control over creation and destiny, and highlighting the spiritual over the miraculous."
  },
  {
    "pauri_number": 32,
    "pauri_punjabi": "ਏਕਾ ਮਾਈ ਜੁਗਤਿ ਵਿਆਈ ਤਿਨਿ ਚੇਲੇ ਪਰਵਾਣੁ ॥\nਇਕੁ ਸੰਸਾਰੀ ਇਕੁ ਭੰਡਾਰੀ ਇਕੁ ਲਾਏ ਦੀਬਾਣੁ ॥\nਜਿਵ ਤਿਸੁ ਭਾਵੈ ਤਿਵੈ ਚਲਾਵੈ ਜਿਵ ਹੋਵੈ ਫੁਰਮਾਣੁ ॥\nਓਹੁ ਵੇਖੈ ਓਨਾ ਨਦਰਿ ਨ ਆਵੈ ਬਹੁਤਾ ਏਹੁ ਵਿਡਾਣੁ ॥\nਆਦੇਸੁ ਤਿਸੈ ਆਦੇਸੁ ॥\nਆਦਿ ਅਨੀਲੁ ਅਨਾਦਿ ਅਨਾਹਤਿ ਜੁਗੁ ਜੁਗੁ ਏਕੋ ਵੇਸੁ ॥੩੦॥",
    "transliteration": "Ekaa Maa-ee jugat vi-aa-ee tin chele parvaan.\nIk sansaaree ik bhandaaree ik laae deebaan.\nJiv tis bhaavai tivai chalaavai jiv hovai furmaan.\nOh vekhai onaa nadar na aavai bahutaa eh vidaan.\nAades tisai aades.\nAad aneel anaad anaahat jug jug eko ves. ||30||",
    "translation": "The One Divine Mother conceived and gave birth to the three accepted disciples.\nOne is the creator of the world, one is the sustainer, and one presides over justice.\nAs it pleases Him, so He directs them; as is His Command.\nHe watches over them, but they cannot see Him; how wonderful this is!\nI bow to Him, I humbly bow.\nThe Primal One, the Pure One, without beginning, without end, remaining the same through all ages. ||30||",
    "explanation": "This pauri addresses the concept of the **Hindu Trinity (Brahma, Vishnu, Shiva)**, not as independent deities but as manifestations of the **One Divine Mother (Maya/Divine Power)**, who herself is a product of the One God. It describes them as accepted 'chele' (disciples) performing their cosmic functions: one as the **creator ('sansaaree')**, one as the **sustainer ('bhandaaree')**, and one as the **judge/destroyer ('laae deebaan')**. The crucial point is that they operate entirely according to **God's pleasure and Command ('furmaan')**. The supreme wonder is that **God oversees them, but they cannot perceive Him**. The repeated salutation to the **Primal, Formless, and unchanging Lord** reinforces His ultimate transcendence and sovereignty over all perceived divine roles and cosmic functions."
  },
  {
    "pauri_number": 33,
    "pauri_punjabi": "ਆਸਣੁ ਲੋਇ ਲੋਇ ਭੰਡਾਰ ॥\nਜੋ ਕਿਛੁ ਪਾਇਆ ਸੁ ਏਕਾ ਵਾਰ ॥\nਕਰਿ ਕਰਿ ਵੇਖੈ ਸਿਰਜਣਹਾਰੁ ॥\nਨਾਨਕ ਸਚੇ ਕੀ ਸਾਚੀ ਕਾਰ ॥\nਆਦੇਸੁ ਤਿਸੈ ਆਦੇਸੁ ॥\nਆਦਿ ਅਨੀਲੁ ਅਨਾਦਿ ਅਨਾਹਤਿ ਜੁਗੁ ਜੁਗੁ ਏਕੋ ਵੇਸੁ ॥੩੧॥",
    "transliteration": "Aasan lo-e lo-e bhandaar.\nJo kichh paa-i-aa so ekaa vaar.\nKar kar vekhai Sirjanhaar.\nNaanak Sache kee Saachee Kaar.\nAades tisai aades.\nAad aneel anaad anaahat jug jug eko ves. ||31||",
    "translation": "His seat is in every world, and His storehouses are in every world.\nWhatever He placed (created) was all at once.\nThe Creator creates, and watches over His creation.\nO Nanak, true is the work of the True One.\nI bow to Him, I humbly bow.\nThe Primal One, the Pure One, without beginning, without end, remaining the same through all ages. ||31||",
    "explanation": "This pauri speaks to God's **omnipresence and omnipotence**. It states that God's **'Aasan' (seat/presence)** is in every world, and His **'Bhandaar' (storehouses of creation and sustenance)** are likewise pervasive. The creation was not a gradual process but a single, instantaneous act: **'Jo kichh paa-i-aa so ekaa vaar'**. The **Creator ('Sirjanhaar')** continuously creates and watches over His creation. Guru Nanak affirms that the **'kaar' (work or action) of the True One is always true and perfect**. The pauri concludes with the customary salutation to the **eternal, unchanging, Primal Lord**, emphasizing His simultaneous immanence (present everywhere) and transcendence (beyond all limits)."
  },
  {
    "pauri_number": 34,
    "pauri_punjabi": "ਇਕ ਦੂ ਜੀਭੌ ਲਖ ਹੋਹਿ ਲਖ ਹੋਵਹਿ ਲਖ ਵੀਸ ॥\nਲਖੁ ਲਖੁ ਗੇੜਾ ਆਖੀਅਹਿ ਏਕੁ ਨਾਮੁ ਜਗਦੀਸ ॥\nਏਤੁ ਰਾਹਿ ਪਤਿ ਪਵੜੀਆ ਚੜੀਐ ਹੋਇ ਇਕੀਸ ॥\nਸੁਣਿ ਗਲਾ ਆਕਾਸ ਕੀ ਕੀਟਾ ਆਈ ਰੀਸ ॥\nਨਾਨਕ ਨਦਰੀ ਪਾਈਐ ਕੂੜੀ ਕੂੜੈ ਠੀਸ ॥੩੨॥",
    "transliteration": "Ik doo jeebhau lakh hohi lakh hovahi lakh vees.\nLakhu lakhu geraa aakhee-ah ek Naam Jagdees.\nEt raahi pat pavarhee-aa charhee-ai ho-e ikees.\nSun galaa aakaas kee keetaa aa-ee rees.\nNaanak nadaree paa-ee-ai koorhee koorhai thhees. ||32||",
    "translation": "If I had a hundred thousand tongues, and then twenty times a hundred thousand more,\nI would chant the Name of the Lord of the Universe hundreds of thousands of times.\nBy this path, by these steps, one ascends and becomes one with Him.\nUpon hearing of the heavens, even worms desire to emulate them.\nO Nanak, by His Glance of Grace, He is obtained; all false pride is useless. ||32||",
    "explanation": "This pauri expresses the **intense desire to chant the Divine Name**. Guru Nanak states that even if he possessed countless tongues, he would chant the **Name of God ('Ek Naam Jagdees') hundreds of thousands of times**. This chanting is presented as the **path and ladder ('pavarhee-aa') to ascend and become one with the Divine ('ho-e ikees')**. It implies that the aspiration to reach high spiritual states is natural, even for the humblest (like a worm wanting to emulate the heavens). However, the ultimate message is that **God is attained only through His Grace ('Nadar')**, not through human effort or pride. All false pride and empty boasts are futile in this spiritual pursuit."
  },
  {
    "pauri_number": 35,
    "pauri_punjabi": "ਆਖਣਿ ਜੋਰੁ ਚੁਪੈ ਨਹ ਜੋਰੁ ॥\nਜੋਰੁ ਨ ਮੰਗਣਿ ਦੇਣਿ ਨ ਜੋਰੁ ॥\nਜੋਰੁ ਨ ਜੀਵਣਿ ਮਰਣਿ ਨਹ ਜੋਰੁ ॥\nਜੋਰੁ ਨ ਰਾਜਿ ਮਾਲਿ ਮਨਿ ਸੋਰੁ ॥\nਜੋਰੁ ਨ ਸੁਰਤੀ ਗਿਆਨਿ ਵੀਚਾਰਿ ॥\nਜੋਰੁ ਨ ਜੁਗਤੀ ਛੁਟੈ ਸੰਸਾਰੁ ॥\nਜਿਸੁ ਹਥਿ ਜੋਰੁ ਕਰਿ ਵੇਖੈ ਸੋਇ ॥\nਨਾਨਕ ਉਤਮੁ ਨੀਚੁ ਨ ਕੋਇ ॥੩੩॥",
    "transliteration": "Aakhan jor chupai nah jor.\nJor na mangan den na jor.\nJor na jeevan maran nah jor.\nJor na raaj maal man sor.\nJor na surtee gi-aan veechaar.\nJor na jugtee chhuttai sansaar.\nJis hath jor kar vekhai so-e.\nNaanak utam neech na ko-e. ||33||",
    "translation": "There is no power in speaking, no power in silence.\nNo power to beg, no power to give.\nNo power to live, no power to die.\nNo power in kingship, wealth, or mental clamor.\nNo power in spiritual understanding, wisdom, or meditation.\nNo power in finding the way to escape the world.\nHe alone has the power, in His hands, and He watches over all He has made.\nO Nanak, no one is high or low. ||33||",
    "explanation": "This pauri profoundly underscores the **lack of true power in human hands**, asserting that all real power resides with God. It states that humans have no power in speaking or remaining silent, in giving or receiving, in living or dying. Worldly power, wealth, and mental intellectual pursuits also lack true 'jor' (power). Even spiritual understanding, wisdom, meditation, or finding methods to escape the cycle of reincarnation are not within human control. The core message is that **only God possesses true power**, and He orchestrates everything. The concluding line, **'Nanak utam neech na ko-e' (no one is high or low)**, signifies that in the eyes of the all-powerful God, human distinctions of status are meaningless, emphasizing equality and humility before the Divine."
  },
  {
    "pauri_number": 36,
    "pauri_punjabi": "ਰਾਤੀ ਰੁਤੀ ਥਿਤੀ ਵਾਰ ॥\nਪਵਣ ਪਾਣੀ ਅਗਨੀ ਪਾਤਾਲ ॥\nਤਿਸੁ ਵਿਚਿ ਧਰਤੀ ਥਾਪਿ ਰਖੀ ਧਰਮ ਸਾਲ ॥\nਤਿਸੁ ਵਿਚਿ ਜੀਅ ਜੁਗਤਿ ਕੇ ਰੰਗ ॥\nਤਿਨ ਕੇ ਨਾਮ ਅਨੇਕ ਅਨੰਤ ॥\nਕਰਮੀ ਕਰਮੀ ਹੋਇ ਵੀਚਾਰੁ ॥\nਸਚਾ ਆਪਿ ਸਚਾ ਦਰਬਾਰੁ ॥\nਤਿਥੈ ਸੋਹਨਿ ਪੰਚ ਪਰਵਾਣੁ ॥\nਨਦਰੀ ਕਰਮਿ ਪਵੈ ਨੀਸਾਣੁ ॥\nਕਚ ਪਕਾਈ ਓਥੈ ਪਾਇ ॥\nਨਾਨਕ ਗਇਆ ਜਾਪੈ ਜਾਇ ॥੩੪॥",
    "transliteration": "Raatee rutee thitee vaar.\nPavan paanee agnee paataal.\nTisu vich dhartee thaap rakhee Dharam Saal.\nTisu vich jee-a jugat ke rang.\nTin ke Naam anek anant.\nKarmee karmee ho-e veechaar.\nSachaa Aap Sachaa Darbaar.\nTithai sohni panch parvaan.\nNadree karam pavai neesaan.\nKach pakaa-ee othhai paae.\nNaanak ga-i-aa jaapai jaae. ||34||",
    "translation": "Nights, seasons, lunar days, and weekdays;\nAir, water, fire, and the nether regions.\nAmidst these, He established the Earth as the House of Dharma (righteousness).\nWithin it are beings of various kinds and colors (ways of life).\nTheir Names are countless and endless.\nAccording to their actions, they are judged.\nThe Lord Himself is True, and True is His Court.\nThere, the five accepted ones (the spiritually evolved) look beautiful.\nBy His Glance of Grace, and by His actions, they receive the mark of approval.\nThere, the raw (unripe) and the ripe (spiritually mature) are distinguished.\nO Nanak, when one goes there, this is truly known. ||34||",
    "explanation": "This pauri describes the **Earth as a 'Dharam Saal' (House of Righteousness or moral action)**, established by God amidst the cosmos, complete with nights, seasons, elements (air, water, fire), and various realms. It emphasizes the diversity of life on Earth, with countless beings and names. The core message is that **judgment ('veechaar') occurs based on one's 'karam' (actions)**. God Himself is Truth, and His **Divine Court ('Darbaar') is also true and just**. It is in this Court that the **'Panch' (spiritually accepted ones)** are honored. Their acceptance is not based on mere actions but primarily on **God's Grace ('Nadar') and His divine will ('karam')**, which marks them as approved. The pauri concludes that the distinction between the spiritually 'raw' (immature) and 'ripe' (mature) is made there, a truth that becomes evident upon reaching that Divine Court. This highlights the importance of righteous living and the ultimate role of divine grace in salvation."
  },
  {
    "pauri_number": 37,
    "pauri_punjabi": "ਧਰਮ ਖੰਡ ਕਾ ਏਹੋ ਧਰਮੁ ॥\nਗਿਆਨ ਖੰਡ ਕਾ ਆਖਹੁ ਕਰਮੁ ॥\nਕੇਤੇ ਪਵਣ ਪਾਣੀ ਵੈਸੰਤਰ ਕੇਤੇ ਕਾਨ ਮਹੇਸ ॥\nਕੇਤੇ ਬਰਮੇ ਘਾੜਤਿ ਘੜੀਅਹਿ ਰੂਪ ਰੰਗ ਕੇ ਵੇਸ ॥\nਕੇਤੀਆ ਕਰਮ ਭੂਮੀ ਮੇਰ ਕੇਤੇ ਕੇਤੇ ਧੂ ਉਪਦੇਸ ॥\nਕੇਤੇ ਇੰਦ ਚੰਦ ਸੂਰ ਕੇਤੇ ਕੇਤੇ ਮੰਡਲ ਦੇਸ ॥\nਕੇਤੇ ਸਿਧ ਬੁਧ ਨਾਥ ਕੇਤੇ ਕੇਤੇ ਦੇਵੀ ਵੇਸ ॥\nਕੇਤੇ ਦੇਵ ਦਾਨਵ ਮੁਨਿ ਕੇਤੇ ਕੇਤੇ ਰਤਨ ਸਮੁੰਦ ॥\nਕੇਤੀਆ ਖਾਣੀ ਕੇਤੀਆ ਬਾਣੀ ਕੇਤੇ ਪਾਤ ਨਰਿੰਦ ॥\nਕੇਤੀਆ ਸੁਰਤੀ ਸੇਵਕ ਕੇਤੇ ਨਾਨਕ ਅੰਤੁ ਨ ਅੰਤੁ ॥੩੫॥",
    "transliteration": "Dharam Khand kaa eho Dharam.\nGi-aan Khand kaa aakhahu karam.\nKete pavan paanee vaisantar kete kaan mahes.\nKete barme ghaarhat gharhee-ah roop rang ke ves.\nKetee-aa karam bhoomee mer kete kete Dhoo updes.\nKete Ind Chand Soor kete kete mandal des.\nKete Sidh Budh Naath kete kete Devee ves.\nKete dev daanav mun kete kete ratan samund.\nKetee-aa khaanee ketee-aa baanee kete paat narind.\nKetee-aa surtee sevak kete Naanak ant na ant. ||35||",
    "translation": "This is the essence of the Realm of Righteousness.\nNow, I shall describe the actions of the Realm of Knowledge:\nSo many airs, waters, and fires; so many Krishnas and Shivas.\nSo many Brahmas fashioned, creating forms, colors, and garbs.\nSo many lands of action (karma bhoomi), so many mountains, so many Dhruvs giving instruction.\nSo many Indras, so many moons and suns; so many worlds and lands.\nSo many Siddhas, Buddhas, and Naths; so many Goddesses.\nSo many gods, demons, and silent sages; so many jewels in the oceans.\nSo many sources of creation (from egg, womb, sweat, earth); so many languages; so many lines of kings.\nSo many enlightened ones, so many servants; O Nanak, there is no end to their ends. ||35||",
    "explanation": "This pauri is the first of five (35-38) describing the **'Panch Khand' or Five Realms/Stages of Spiritual Journey**. This pauri specifically discusses the **'Dharam Khand' (Realm of Righteousness)** and begins the description of **'Giaan Khand' (Realm of Knowledge)**. It uses **'Kete' (so many, countless)** to emphasize the incredible diversity and vastness of creation within the Realm of Knowledge. It enumerates countless elements (air, water, fire), Hindu deities (Krishna, Shiva, Brahma), forms, colors, lands of action, mountains, sages (like Dhruv), celestial bodies (Indras, moons, suns), worlds, spiritual masters (Siddhas, Buddhas, Naths), goddesses, gods, demons, munis, oceanic jewels, sources of creation, languages, and rulers. The repeated phrase **'ant na ant' (no end to their ends)** powerfully conveys the **limitless nature of God's creation within the Realm of Knowledge**, which is characterized by the vastness of diversity and forms. It suggests that in this realm, the seeker begins to grasp the sheer immensity and diversity of God's handiwork."
  },
  {
    "pauri_number": 38,
    "pauri_punjabi": "ਗਿਆਨ ਖੰਡ ਮਹਿ ਗਿਆਨੁ ਪਰਚੰਡੁ ॥\nਤਿਥੈ ਨਾਦ ਬਿਨੋਦ ਕੋਡ ਅਨੰਦੁ ॥\nਸਰਮ ਖੰਡ ਕੀ ਬਾਣੀ ਰੂਪੁ ॥\nਤਿਥੈ ਘਾੜਤਿ ਘੜੀਐ ਬਹੁਤੁ ਅਨੂਪੁ ॥\nਤਾ ਕੀਆ ਗਲਾ ਕਥੀਆ ਨ ਜਾਹਿ ॥\nਜੇ ਕੋ ਕਹੈ ਪਿਛੈ ਪਛੁਤਾਇ ॥\nਤਿਥੈ ਘੜੀਐ ਸੁਰਤਿ ਮਤਿ ਮਨਿ ਬੁਧਿ ॥\nਤਿਥੈ ਘੜੀਐ ਸੁਰਾ ਸਿਧਾ ਕੀ ਸੁਧਿ ॥੩੬॥",
    "transliteration": "Gi-aan Khand meh gi-aan parchand.\nTithai Naad binod kod anand.\nSaram Khand kee baanee roop.\nTithai ghaarhat gharhee-ai bahut anoop.\nTaa kee-aa galaa kathee-aa na jaahi.\nJe ko kahai pichhai pachhutaa-e.\nTithai gharhee-ai surat mat man budh.\nTithai gharhee-ai suraa sidhaa kee sudh. ||36||",
    "translation": "In the Realm of Knowledge, spiritual wisdom is supreme.\nThere, the Divine Sound, sights of wonder, and millions of joys and bliss abound.\nThe Realm of Humility and Effort has a beautiful form (characterized by divine grace).\nThere, the most wonderfully beautiful spiritual forms are fashioned.\nThe things of that Realm cannot be described.\nWhoever tries to describe them will later regret it.\nThere, awareness, intellect, understanding, and wisdom are fashioned.\nThere, the consciousness of the spiritual heroes and Siddhas is fashioned. ||36||",
    "explanation": "This pauri continues the description of **'Giaan Khand' (Realm of Knowledge)** and introduces **'Saram Khand' (Realm of Humility/Effort)**. In **Giaan Khand**, spiritual wisdom is paramount, accompanied by divine melodies ('Naad'), joyous spectacles, and immense bliss. The pauri then shifts to **'Saram Khand'**, which is characterized by a beautiful form ('baanee roop') and where uniquely beautiful spiritual forms are fashioned. The nature of this realm is **ineffable ('kathee-aa na jaahi')**, and attempts to describe it are futile. Crucially, in **Saram Khand**, the seeker's **awareness ('surat'), intellect ('mat'), mind ('man'), and wisdom ('budh') are refined and shaped**. It's also where the consciousness of spiritual heroes and perfected beings is developed. This suggests a stage of intense spiritual discipline and inner transformation where the seeker's faculties are divinely molded."
  },
  {
    "pauri_number": 39,
    "pauri_punjabi": "ਕਰਮ ਖੰਡ ਕੀ ਬਾਣੀ ਜੋਰੁ ॥\nਤਿਥੈ ਹੋਰੁ ਨ ਕੋਈ ਹੋਰੁ ॥\nਤਿਥੈ ਜੋਧ ਮਹਾਬਲ ਸੂਰ ॥\nਤਿਨ ਮਹਿ ਰਾਮੁ ਰਹਿਆ ਭਰਪੂਰ ॥\nਤਿਥੈ ਸੀਤੋ ਸੀਤਾ ਮਹਿਮਾ ਮਾਹਿ ॥\nਤਾ ਕੇ ਰੂਪ ਨ ਕਥਨੇ ਜਾਹਿ ॥\nਨਾ ਓਹਿ ਮਰਹਿ ਨ ਠਾਗੇ ਜਾਹਿ ॥\nਜਿਨ ਕੈ ਰਾਮੁ ਵਸੈ ਮਨ ਮਾਹਿ ॥\nਤਿਥੈ ਭਗਤ ਵਸਹਿ ਕੇ ਲੋਅ ॥\nਕਰਹਿ ਅਨੰਦੁ ਸਚਾ ਮਨਿ ਸੋਇ ॥\nਸਚ ਖੰਡਿ ਵਸੈ ਨਿਰੰਕਾਰੁ ॥\nਕਰਿ ਕਰਿ ਵੇਖੈ ਨਦਰਿ ਨਿਹਾਲ ॥\nਤਿਥੈ ਖੰਡ ਮੰਡਲ ਵਰਭੰਡ ॥\nਜੇ ਕੋ ਕਥੈ ਤ ਅੰਤੁ ਨ ਅੰਤੁ ॥\nਤਿਥੈ ਲੋਅ ਲੋਅ ਆਕਾਰ ॥\nਜਿਵ ਜਿਵ ਹੁਕਮੁ ਤਿਵੈ ਤਿਵ ਕਾਰ ॥\nਵੇਖੈ ਵਿਗਸੈ ਕਰਿ ਵੀਚਾਰੁ ॥\nਨਾਨਕ ਕਥਨਾ ਕਰੜਾ ਸਾਰੁ ॥੩੭॥",
    "transliteration": "Karam Khand kee baanee jor.\nTithai hor na ko-ee hor.\nTithai jodh mahaabal soor.\nTin meh Raam rahi-aa bharpoor.\nTithai seeto seetaa mahimaa maahi.\nTaa ke roop na kathne jaahi.\nNa oh mareh na thhaage jaahi.\nJin kai Raam vasai man maahi.\nTithai bhagat vaseh ke lo-a.\nKarahi anand sachaa man so-e.\nSach Khand vasai Nirankaar.\nKar kar vekhai nadar nihaal.\nTithai khand mandal varbhand.\nJe ko kathai ta ant na ant.\nTithai lo-a lo-a aakaar.\nJiv jiv hukam tivai tiv kaar.\nVekhai vigsai kar veechaar.\nNaanak kathnaa karh-raa saar. ||37||",
    "translation": "The Realm of Grace (Karam Khand) is dominated by divine power.\nNo one else can compare with those there.\nThere live the mighty warriors and supreme heroes.\nWithin them, the Lord is fully pervasive.\nThere, they are imbued with the glory of God, soaked in His praise.\nTheir forms cannot be described.\nThey do not die, nor are they cheated.\nBecause the Lord abides within their minds.\nThere, countless devotees reside.\nThey experience true joy, for the True One is in their minds.\nIn the Realm of Truth (Sach Khand) resides the Formless Lord.\nHe creates, and beholds, and is overjoyed with His Glance of Grace.\nThere are the continents, worlds, and universes.\nIf anyone were to describe them, there would be no end to their ends.\nThere are worlds upon worlds, and forms upon forms.\nAs is His Command, so is His creative act.\nHe watches over all, and is immensely pleased, reflecting on His creation.\nO Nanak, this description is as hard as steel. ||37||",
    "explanation": "This pauri describes **'Karam Khand' (Realm of Grace/Divine Power)** and then transitions into **'Sach Khand' (Realm of Truth)**, the ultimate spiritual abode. In **Karam Khand**, the prevailing force is God's power. Those who reach here are mighty spiritual warriors, completely filled with God's presence. They are eternally absorbed in His glory, their forms beyond description. They are immortal and cannot be deceived because God resides within their minds. Countless devotees live here, experiencing true bliss with God in their hearts. The pauri then ascends to **'Sach Khand'**, the dwelling place of the **Formless Lord ('Nirankar')**. Here, God creates and joyfully oversees His creation with His graceful glance. This realm contains infinite worlds and universes, and their description is endless. All creation operates purely by God's **Command ('Hukam')**. He watches over it, is pleased, and reflects upon it. Guru Nanak concludes by stating that describing this ultimate reality is an incredibly difficult, 'hard as steel', task, emphasizing its transcendental nature."
  },
  {
    "pauri_number": 40,
    "pauri_punjabi": "ਜਤੁ ਪਾਹਾਰਾ ਧੀਰਜੁ ਸੁਨਿਆਰੁ ॥\nਅਹਰਣਿ ਮਤਿ ਵੇਦੁ ਹਥੀਆਰੁ ॥\nਭਉ ਖਲਾ ਅਗਨਿ ਤਪ ਤਾਉ ॥\nਭਾਂਡਾ ਭਾਉ ਅੰਮ੍ਰਿਤੁ ਤਿਤੁ ਢਾਲਿ ॥\nਘੜੀਐ ਸਬਦੁ ਸਚੀ ਟਕਸਾਲ ॥\nਜਿਨ ਕਉ ਨਦਰਿ ਕਰਮੁ ਤਿਨ ਕਾਰ ॥\nਨਾਨਕ ਨਦਰੀ ਨਦਰਿ ਨਿਹਾਲ ॥੩੮॥",
    "transliteration": "Jat paahaaraa dheeraj suni-aar.\nAharn mat ved hathee-aar.\nBha-o khalaa agan tap taa-o.\nBhaandaa bhaa-o amrit tit dhaal.\nGharhee-ai Sabad Sachee Taksaal.\nJin ka-o nadar karam tin kaar.\nNaanak nadaree nadar nihaal. ||38||",
    "translation": "Let self-control be the goldsmith's forge, and patience the goldsmith.\nLet understanding be the anvil, and spiritual wisdom the tools.\nLet the Fear of God be the bellows, and austere discipline the fire.\nLet love be the crucible, and in it, melt the Nectar (of the Name).\nIn this True Mint, the Shabad (Divine Word) is fashioned.\nThose who are blessed with His Grace and compassion, perform this spiritual practice.\nO Nanak, by His Gracious Glance, one is made happy and blessed. ||38||",
    "explanation": "This is the final pauri of Japji Sahib, often considered the **conclusion of the spiritual methodology**. It uses the metaphor of a **goldsmith's mint** to describe the process of forging the **Divine Word (Shabad)** within oneself. **Self-control ('jat')** is the forge, **patience ('dheeraj')** the goldsmith, **understanding ('mat')** the anvil, and **spiritual wisdom ('ved')** the tools. **Fear of God ('Bha-o')** becomes the bellows (which fuels the fire), and **austere discipline ('tap taa-o')** is the fire itself. The **crucible ('bhaandaa')** is divine **love ('bhaa-o')**, where the **Nectar of the Naam ('Amrit')** is melted. Through this rigorous spiritual process, the **'Shabad' (Divine Word)** is fashioned in the **'Sachee Taksaal' (True Mint)**. The pauri concludes by stating that this profound spiritual work is undertaken only by those who receive **God's Grace ('Nadar') and compassion ('karam')**. Ultimately, it is through **God's benevolent glance ('Nadaree Nadar Nihaal')** that one attains supreme bliss and fulfillment. This pauri summarizes the path of spiritual discipline leading to the internalization of the Divine Word and ultimate union with God, all made possible by His Grace."
  },
  {
    "pauri_number": 41,
    "pauri_punjabi": "ਪਵਣੁ ਗੁਰੂ ਪਾਣੀ ਪਿਤਾ ਮਾਤਾ ਧਰਤਿ ਮਹਤੁ ॥\nਦਿਵਸੁ ਰਾਤਿ ਦੁਇ ਦਾਈ ਦਾਇਆ ਖੇਲੈ ਸਗਲ ਜਗਤੁ ॥\nਚੰਗਿਆਈਆ ਬੁਰਿਆਈਆ ਵਾਚੈ ਧਰਮੁ ਹਦੂਰਿ ॥\nਕਰਮੀ ਆਪੋ ਆਪਣੀ ਕੇ ਨੇੜੈ ਕੇ ਦੂਰਿ ॥\nਜਿਨੀ ਨਾਮੁ ਧਿਆਇਆ ਗਏ ਮਸਕਤਿ ਘਾਲਿ ॥\nਨਾਨਕ ਤੇ ਮੁਖ ਉਜਲੇ ਕੇਤੀ ਛੁਟੀ ਨਾਲਿ ॥੧॥",
    "transliteration": "Pavan Guru Paanee Pitaa Maataa Dharat Mahat.\nDivas raat du-e daa-ee daa-i-aa khelai sagal jagat.\nChangiaa-ee-aa buri-aa-ee-aa vaachai Dharam Hadoor.\nKarmee aapo aapnee ke nerhai ke door.\nJinee Naam dhi-aa-i-aa ga-e maskat ghaal.\nNaanak te mukh ujle ketee chhutee naal. ||1||",
    "translation": "Air is the Guru, Water the Father, and the great Earth the Mother.\nDay and night are the two nurses, male and female, in whose lap all the world plays.\nRighteousness and sin are judged by the Judge of Dharma in His presence.\nBy their own actions, some are drawn closer, and some are driven farther away.\nThose who meditated on the Naam (Name of God), their toil is accomplished.\nO Nanak, their faces are radiant, and many others are saved along with them. ||1||",
    "explanation": "This **Salok (epilogue/summary)** encapsulates the essence of Japji Sahib. It personifies natural elements as fundamental guides and providers: **Air as the Guru (life-giver/teacher)**, **Water as the Father (source of life)**, and the **Earth as the Great Mother (sustainer)**. Day and night are depicted as the **two nurses** in whose lap all humanity plays. It emphasizes that **all actions, good or bad, are ultimately judged by the Judge of Dharma (Righteousness)** in God's presence, leading to consequences that either bring one closer to or farther from the Divine. The Salok concludes with the ultimate reward: **those who meditate on the Naam (Name of God)** successfully complete their spiritual journey ('maskat ghaal'), their faces shine with divine grace, and their liberation becomes a means for **many others to be saved along with them**. This highlights the profound impact of individual spiritual devotion on the collective and underscores the central message of Naam Simran (meditation on the Name) as the path to liberation."
  }
]